{
    "university_name": "University of Wyoming",
    "university_email": "",
    "university_rank": "175",
    "university_url": "https://www.uwyo.edu/",
    "university_phone": "(307) 766-1121",
    "university_address": "1000 E. University Ave\nLaramie, WY 82071",
    "university_campus": "Laramie",
    "department_url": "https://www.uwyo.edu/eecs/index.html",
    "department_name": "Electrical Engineering and Computer Science",
    "program_url": "https://www.uwyo.edu/uw/degree-programs/electrical-engineering-masters.html",
    "program_type": "Masters",
    "degree_program": "Graduate",
    "program_name": "M.S. in Electrical Engineering",
    "delivery_type": "offline",
    "session": "Fall,Spring,Summer",
    "duration": "",
    "scholarship": "TRUE",
    "useful_links": "\"Electrical Engineering and Computer Science Graduate Admission Information:https://www.uwyo.edu/eecs/graduate/admissions.html\",\"Department Graduate Degree Information:https://www.uwyo.edu/eecs/graduate/index.html\"",
    "associated_links": {
        "url_1": "https://www.uwyo.edu/uw/disclaimer.html",
        "url_2": "https://www.uwyo.edu/eecs/faculty-staff/index.html",
        "url_3": "https://www.uwyo.edu/admissions/request-information/index.html",
        "url_4": "https://www.uwyo.edu/admissions/visit/index.html",
        "url_5": "https://www.uwyo.edu/uw/degree-programs/electrical-engineering-phd.html",
        "url_6": "https://www.uwyo.edu/ceps/index.html",
        "url_7": "https://www.uwyo.edu/uw/degree-programs/cybersecurity-certificate.html",
        "url_8": "https://www.uwyo.edu/research/index.html",
        "url_9": "https://www.uwyo.edu/sfa/cost-of-attendance/index.html",
        "url_10": "https://www.uwyo.edu/eecs/about/index.html",
        "url_11": "https://www.uwyo.edu/admissions/apply.html",
        "url_12": "https://www.uwyo.edu/uw/degree-programs/computer-science-ms-phd.html"
    },
    "program_details": {
        "main": "## We value your privacy\nThe University of Wyoming uses cookies to enhance your browsing experience, serve personalized ads or content, and analyze our traffic. By clicking \"Accept All\", you consent to our use of cookies. You may withdraw your consent at any time by clicking the small icon at the bottom left corner of the website. [UW Privacy & Cookie Policy](https://www.uwyo.edu/uw/disclaimer.html)\nAccept all Decline all powered by: [Cookie Information](https://cookieinformation.com/)\n* Functional\n* Statistical\n* Marketing\n# Electrical Engineering\n## Master of Science (M.S.)\n[Apply Now](https://www.uwyo.edu/admissions/apply.html)[Visit Campus](https://www.uwyo.edu/admissions/visit/index.html)\n## Power Your Future with a Master’s in Electrical Engineering\nThough the world is well into the digital revolution, we are on the frontier of technologies that will allow people to use their thoughts to power assistive devices, \"see\" with advanced artificial vision sensors, create tools to monitor and protect the nation's power grid and up-level next-generation industrial automation. It's all happening on Wyoming's beautiful high plains.\nAnd we want you to be a part of it!\n[ Request Info ](https://www.uwyo.edu/admissions/request-information/index.html)\nThis program is currently offered in   \nthe following locations: \nLaramie Campus\n## About Electrical Engineering at UW\n###  Program Overview \nIn our collaborative graduate electrical engineering program, you will have the chance to customize your experience with a series of concentrations that will expose you to the up-to-the-minute and upcoming technologies shaping the world.  \n  \nOur faculty are active researchers, working on pioneering projects that are changing health care, improving mobility for people with physical disabilities and accelerating the speed of computer processing. And, they are making these advances in concert with the students in their labs and research groups.  \n  \nThe electrical engineering coursework, research and projects you'll complete as a UW electrical engineering M.S. student prepare you to pursue a career that can make the world a safer more accessible place.\n###  Concentrations \n**Customize your degree by selecting a degree concentration in one of these areas:**\n  * Bio-Engineering\n  * Controls\n  * Electrical Energy Systems\n  * Electronic Systems and Devices\n  * Robotics\n  * Signal Processing and Computer Networks\n\n\n###  Courses & Curriculum \n## Electrical Engineering, M.S.\nDesigned to teach cutting-edge skills needed to excel, whether students enter the workforce or continue onto a PhD. Foci include: Computer Vision, Controls, Elec. Energy Systems, IoT, AI, and Robotics and Signal Processing.\n### Plan A (Thesis)\nThis is a minimum 30 credit hour program, 26 hours coursework and 4 hours of thesis\n  * Minimum 16 Course Hours in Electrical and Computer Engineering Course Work\n  * Minimum 3 Course Hours in Formal Course Work outside the Electrical and Computer Engineering Department approved by the student's committee\n  * 7 Additional Formal Course Hours in or out of the Electrical and Computer Engineering Department\n  * 4 credits of MS thesis research\n  * No more than 12 credit hours can be at the 4000 level\n  * No more than 3 credit hours of independent study\n\n\nOf the above credit hours in formal coursework, no more than 12 credit hours can be 4000 level\nThe candidate must meet the minimum requirements for the Master of Science degree and also complete and defend a master's thesis.\n### Plan B (with Paper)\nThis is a 30 hour program:\n  * Minimum 18 Course Hrs in Electrical and Computer Engineering Course Work\n  * Minimum 3 Course Hrs in Formal Course Work outside the Electrical and Computer Engineering Department\n  * 9 Additional Formal Course Hrs in or out of the Electrical and Computer Engineering Department\n  * No more than 12 credit hours can be at the 4000 level\n  * No more than 3 credit hours of independent study\n\n\n### Plan B (Coursework Only)\nThis is a 30 hour program:\n  * Minimum 18 Course Hrs in Electrical and Computer Engineering Course Work\n  * Minimum 3 Course Hrs in Formal Course Work outside the Electrical and Computer Engineering Department\n  * 9 Additional Formal Course Hrs in or out of the Electrical and Computer Engineering Department\n  * No more than 12 credit hours can be at the 4000 level\n  * No more than 3 credit hours of independent study\n\n\nOf the above credit hours in formal coursework, no more than 12 can be 4000 level.\n## Electrical Engineering Master's Degree Program Highlights\nSelect a Highlight\nThesis/Non-Thesis Options  Outstanding Faculty  Assistantships  Cutting-Edge Facilities \nThesis/Non-Thesis Options \nElect to do a research-based thesis and thesis poster (Plan A), take additional classes and complete an electrical engineering project (Plan B) or engage in coursework only (Plan B).\n[CURRICULUM INFO](https://acalogcatalog.uwyo.edu/preview_program.php?catoid=16&poid=17370&returnto=1485 \"View curriculum information\")\nWork with world-class electrical engineering faculty who are working on research and technology that will alter the way we live and work in areas such as health care, energy, the environment and more.\n[Meet Our Faculty](https://www.uwyo.edu/eecs/faculty-staff/index.html \"Learn more about our faculty\")\nMost UW electrical engineering graduate students subsidize their degree programs by working as research or teaching assistants.\nTake advantage of UW's outstanding research facilities. The Department of Electrical Engineering and Computer Science (EECS) has 10 laboratories that include circuits, electronics, digital design and microprocessor labs, among others.\n[EECS Facilities](https://www.uwyo.edu/eecs/about/index.html \"Learn more about facilities\")\nThesis/Non-Thesis Options \n### Select a Highlight\nThesis/Non-Thesis Options  Outstanding Faculty  Assistantships  Cutting-Edge Facilities \n## What Can You Do With an Electrical Engineering Master's Degree?\nWith a master’s in electrical engineering, you’ll open the door to exciting, high-level roles in fields like robotics, energy and tech. It’s a great way to deepen your expertise, lead innovative projects and stand out in a competitive job market!\nWhat jobs and careers are available with an electrical engineering master's degree? \n  * Electrical Engineer\n  * Systems Engineer\n  * Power Systems Engineer\n  * Control Systems Engineer\n  * Electronics Design Engineer\n  * Embedded Systems Engineer\n  * Robotics Engineer\n  * Signal Processing Engineer\n  * Radio Frequency Engineer\n  * Automation Engineer\n  * Hardware Engineer\n  * Firmware Engineer\n  * Research and Development Specialist\n  * Project Manager\n  * Aerospace Engineer\n  * Communications Systems Engineer\n  * Energy Systems Engineer\n  * AI/ML Engineer\n  * Semiconductor Engineer\n  * Product Development Engineer\n\n\nWhat positions have UW’s electrical alumni gone on to hold? \n  * Director of Engineering, Systems Validation at Intel\n  * Software/Electrical Engineer, Engineering Propulsion Laboratory at Lockheed Martin Space Systems Company\n  * Engineer at Micron Technology\n  * ASIC Engineer at Facebook\n  * Engineer for the U.S. Army\n  * Electrical Engineer at Gogo Business Aviation\n  * Principal Electrical Engineer at Fossil Group, Inc.\n  * Senior Design Engineer at Avago Technologies\n\n\nWill a master’s degree help me stand out in this competitive field? \nYes, earning a master’s degree can definitely help you stand out in the competitive field of electrical engineering. It shows advanced expertise, opens doors to higher-level roles, and can lead to better job prospects, higher pay and opportunities to work on cutting-edge projects.\nWhat industries are actively seeking to hire electrical engineers with a master’s degree? \nWith a master’s in electrical engineering, you’ll find opportunities in a wide variety of industries—tech, aerospace, renewable energy, robotics, telecom and more. These fields are looking for people with advanced skills to help lead innovation and tackle complex challenges.\n### UW Electrical Engineering Graduate Students Making A Real Impact\nAs a graduate student, Bradley Riotto, M.S. '19, helped build an FDA-approved augmented-reality system that today is enabling doctors to more easily perform ultrasound-guided surgical injections. Riotto currently works as a Software Engineering Lead at SFL Scientific, a Deloitte Business.\n“I worked with some of the best professors in the trade and learned a lot of basics of electrical engineering from them. It's what got me my first break. If it wasn't for [my education at] Wyoming, I would not be doing the kind of work I do today.\"\n- Punit Soni | Electrical Engineering M.S. '00\n[Apply Now](https://www.uwyo.edu/admissions/apply.html)[Visit Campus](https://www.uwyo.edu/admissions/visit/index.html)[Request Info](https://uwyo-erx.my.salesforce-sites.com/leads/apex/ERx_Forms__PageMaker?pageId=Graduate&amp;UW=Grad)\n### Related Programs\nInterested in a M.S. in electrical engineering? UW offers other programs that might interest you such as:\n  * [M.S. or Ph.D. in Computer Science](https://www.uwyo.edu/uw/degree-programs/computer-science-ms-phd.html \"More information about the M.S. or Ph.D. in Computer Science\")\n  * [Ph.D. in Electrical Engineering](https://www.uwyo.edu/uw/degree-programs/electrical-engineering-phd.html \"More information about the Ph.D. in Electrical Engineering\")\n  * [Cybersecurity Certificate](https://www.uwyo.edu/uw/degree-programs/cybersecurity-certificate.html \"More information about the Cybersecurity Certificate\")\n\n\nQuick Links\n[Tuition & Fees](https://www.uwyo.edu/sfa/cost-of-attendance/index.html \"View tuition and fees information\")[Courses & Curriculum Information](https://acalogcatalog.uwyo.edu/preview_program.php?catoid=16&poid=17370&returnto=1485 \"View courses and curriculum information\")[Accreditation](https://www.abet.org/ \"View accreditation information\")\nDepartments\n[College of Engineering and Physical Sciences](https://www.uwyo.edu/ceps/index.html \"More information about the College of Engineering and Physical Sciences\")[Department of Electrical Engineering and Computer Science](https://www.uwyo.edu/eecs/about/index.html \"Learn more about the Department of Electrical Engineering and Computer Science\")\n## Contact Us\nCollege of Engineering and Physical Sciences\n  * Department of Electrical Engineering and Computer Science\n  * Department 3295, 1000 E. University Avenue\n  * Laramie, WY 82071\n  * Email: ece@uwyo.edu\n  * Phone: [(307) 766-2279](tel:307-766-2279)\n\n\nThe University of Wyoming has earned its Research Level 1 (R1) status from the Carnegie Classification of Institutions of Higher Education, placing Wyoming's only four-year university with the [top research universities](https://www.uwyo.edu/research/index.html \"Learn more about the research happening at the University of Wyoming\") in the United States.\n",
        "url_1": "# University of Wyoming Privacy Notice\nThe University of Wyoming (UW) understands that privacy is important to you. UW values your privacy and is committed to maintaining your trust. Therefore, we provide this Privacy Notice explaining how your information may be processed, managed and protected by us. This Privacy Notice describes how UW may collect, use, and share information you directly and indirectly provide when using UW websites.\nThis Policy Notice does not cover the practices of our third-party partners (e.g., vendors), nor does it apply to Personally Identifiable Information (PII) that we collect from or about our employees, vendors, consultants, or contractors. Additionally, some UW websites may deviate from this notice. In these cases, we encourage you to read page-specific notices to ensure you understand the applicable privacy policies and practices.\nBy using UW websites, you agree to the Terms and Conditions of this Privacy Notice and to our processing of personal information for the purposes stated below. If you do not agree to the Terms and Conditions of the Privacy Statements, please do not use the site or the mobile applications.  \n  \n\n**International Visitors  \n** UW is located in the United States (State of Wyoming). By providing information to UW, you are transferring your personal data to the United States. If you are providing personal information and are not a resident of the United States, your country’s laws governing data collection and use may differ from those in the United States. The United States has not sought nor received a finding of “adequacy” from the European Union under Article 45 of the GDPR, and UW relies on derogations for specific situations as set forth in Article 49 of the GDPR.  \n  \n\n**What Information We Collect  \n** UW collects personal information about you when you voluntarily provide it. Other services may require additional information through an account in order to access certain features; an account, created for you to authenticate into a system or service, includes personal information identifying you for the sake of the service.\n\"Personal information\" is any information that can be used to identify you or that may be linked to you. This information is commonly limited to the information found in a public directory, such as first name, last name, postal address, email address, and phone number.  \n  \n\n**Websites  \n** When you visit University of Wyoming websites, we collect and use information provided to us by your browser, IP, site requests, etc. to customize your experience. Other examples of how we may use this data include (1) to deliver the content of our websites correctly, (2) optimize user experience, (3) receive and provide marketing feedback, and (4) deter and prevent abuse of our sites.\nFor you knowledge, the data we collect may include the following information provided by your browser, ISP, and operating system. \n  * The public Internet Protocol (IP) address of the device through which you access UW websites.\n  * The Uniform Resource Locator (URL) of the website from which a device reaches a UW website (called a referrer), typically by following a link.\n  * The webpages requested from the UW websites.\n  * The Date and Time of Access.\n  * The Operating System of the device through which you access UW websites.\n  * The Browser Type and Version, the Monitor Screen Size and Color Depth and other plugin and program information as sent by your browser.\n  * Similar data and information that may be used in the event of attacks on our information technology (IT) systems\n\n\n**  \nWeb Analytics  \n** UW websites use analytical tools provided by other companies, such as Google Analytics, a service provided by Google, Inc. We use this data to determine the number of people using our site, their journey through the websites, as well as how they find and use our web pages. These companies may separately record data such as your geographical location, device type, internet browser, operating system, your IP address, and associated information. To opt out of these services, you will need to modify your settings with them directly. To opt out of the Google Analytics advertising features outlined above, [follow Google's opt out instructions](https://tools.google.com/dlpage/gaoptout).\n**  \nCookies and Tracking  \n** UW may also collect certain information passively, such as collecting online, non-identifying information through the use of cookies technology and/or Internet Protocol (“IP”) address tracking. Through the use of cookies, UW provides more user-friendly services. Non-personal identification information might include the browser used by you, the type of computer, the operating systems, the Internet service providers, and other similar information. The UW system also automatically gathers information about the areas you visit on the websites and about the links you may select from within the site to other sites. Most browsers are set to accept cookies. You can set yours to refuse cookies, or to alert you when cookies are being sent; however, if you disable cookies, the full functionality of some our sites may not be available to you.\nPlease note that we do not currently respond to web browser “do not track” signals or other mechanisms that may allow you to opt out of the collection of information across networks of websites and online services as there is no standard for how online services should respond to such signals. As standards develop, we may develop policies for responding to do-not-track signals that we will describe in this Privacy Notice.\n**  \nOther Sources  \n** UW may receive information about you from other sources, including third parties that help us update, expand, and analyze our records, identify new customers, or prevent or detect fraud. UW may also receive information about you from social media platforms, including but not limited to, when you access our social media content or interact with us on these platforms. The information we may receive is governed by the privacy settings, policies, and/or procedures of the applicable social media platform; therefore, we encourage you to review them.\n**  \nChildren  \n** UW does not believe our websites are appealing to children, nor are they directed to children under 13. UW does not knowingly collect personally identifiable data from persons under the age of 13, and strives to comply with the provisions of COPPA (The Children’s Online Privacy Protection Act). If you are a parent of a child under 13, and you believe that your child has provided us with information about him or herself, please contact us our General Counsel office by phone or email.\n**  \nHow We Use Collected Information  \n** UW may use the information we collect:\n  * To respond to your inquiries\n  * To provide services or materials you request\n  * To operate and understand how services are utilized\n  * To maintain our contact list\n  * To provide business services for which the information is intended\n  * To assess the effectiveness of our events, campaigns, and publications\n  * For information processing that is reasonably appropriate or necessary within our legal obligations\n\n\nAs a responsible organization, we do not use automatic decision-making or profiling. Moreover, your personal information will not be used in ways unrelated to the ones described without a clear notice and without providing an opportunity to opt-out or otherwise prohibit unrelated uses.\n**  \nHow We Share Collected Information  \n** UW may share collected information with third parties and other University parties for legitimate business purposes without your consent, including but not limited to, the following reasons or in the following circumstances:\n  * As necessary to complete a transaction for you.\n  * To vendors or third-parties who deliver or provide goods and services or otherwise act on behalf of or at the direction of UW, such as exam testing agencies and partners, product-fulfillment companies, third-party event hosts, other third parties who may provide services on websites that are accessible from links on one of our sites, and credit card companies processing payment;\n  * To UW administration;\n  * To investigate potentially fraudulent or questionable activities;\n  * To cooperate with law enforcement or in response to a government or regulatory request, including if specifically requested or required, as otherwise permitted by law, and for other valid UW business purposes.\n  * Required by law or by an order of a court, regulatory bodies, or governmental authority.\n  * As we deem necessary to protect the rights, safety, or property of UW.\n\n\n  \nUW also may use your profile information on an aggregate basis – without personal identifiers – to provide the University administration and third parties with information, such as developing new features and content for the sites, and providing sponsors and others with aggregate information about our users and the usage patterns of the sites.\n**  \nHow We Protect Collected Information  \n** UW uses reasonable measures to safeguard personal information collected on its sites depending on its sensitivity. In order to prevent unauthorized access or disclosure, we have suitable physical, technical, and managerial controls and procedures to safeguard the information we collect online. Our measures follow applicable laws regarding the safeguarding of information under our control. However, no information system can be 100 percent secure.\nUW is not responsible for the security of information you transmit to us over networks that we do not control, including the Internet, email systems, and wireless networks. Moreover, you are responsible for protecting your username and password and for selecting strong passwords.\nWe retain the information we collect online no longer than as reasonably necessary to fulfill the purposes for which we collect the information and to comply with our legal obligations.\n**  \nHow to Contact UW  \n** Subject to local law, you may have certain rights regarding information that we have collected and that is related to you. We encourage you to contact us to update or correct your information if it changes or if you believe that any information that we have collected about you is inaccurate.\nTo help us keep your personal information up-to-date or if you no longer wish to receive communications from us, please login to the UW website that collected your data and update your information. For general inquiries, please contact our UW’s Privacy Office below for further information.\nRobert Aylward  \nVice President  \nOffice of the CIO  \n(307) 766-4860  \nraylward@uwyo.edu\n**  \nPrivacy Notice Changes  \n** UW may update this Privacy Notice as the need arises, so we encourage you to periodically review this Privacy Notice. If we make any material changes in the way we collect, use, and/or share the personal information that you have provided, we will post notice of the changes in a clear and conspicuous manner on the UW websites.\nThe Privacy Notice is effective as of August 20th, 2020.  \n  \n\n## Equal Opportunity Clause\nPersons seeking admission, employment or access to programs of the University of Wyoming shall be considered without regard to race, sex, gender, color, religion, national origin, disability, age, veteran status, sexual orientation, genetic information, political belief or other status protected by state and federal statutes or University Regulations.\n## Copyright Information\nThe contents of this Web site are copyright protected. Any commercial use requires permission from the University of Wyoming.\n",
        "url_2": "# Faculty & Staff\n## ELECTRICAL ENGINEERING AND COMPUTER SCIENCE\nThe Department of Electrical Engineering and Computer Science (EECS) faculty are focused on preparing students to become the next wave of elite engineers, researchers, and scientists. Through a curriculum enriched by our professors' successful research initiatives and real-world industrial experience, we empower students with the critical skills and insights highly valued by top employers.\n[See our Emeritus Faculty Here!](https://www.uwyo.edu/eecs/faculty-staff/adjunct-and-emeritus/index.html)\n[See our graduate students here!](https://www.uwyo.edu/eecs/faculty-staff/gradstudents/index.html)\nNavigation [ Main Page ](https://www.uwyo.edu/eecs)\nFaculty & Staff\n[LEARN MORE](https://www.uwyo.edu/eecs/faculty-staff/index.html)[Faculty & Staff](https://www.uwyo.edu/eecs/faculty-staff/index.html)[Graduate Students](https://www.uwyo.edu/eecs/faculty-staff/gradstudents/index.html)[Emeritus & Adjunct Faculty](https://www.uwyo.edu/eecs/faculty-staff/adjunct-and-emeritus/index.html)\nGraduate Students\n[LEARN MORE](https://www.uwyo.edu/eecs/faculty-staff/gradstudents/index.html)[Grad Students](https://www.uwyo.edu/eecs/faculty-staff/gradstudents/index.html)[Graduate Programs](https://www.uwyo.edu/eecs/graduate/index.html)\nEmeritus & Adjunct Faculty\n[LEARN MORE](https://www.uwyo.edu/eecs/faculty-staff/adjunct-and-emeritus/index.html)[Faculty & Staff](https://www.uwyo.edu/eecs/faculty-staff/index.html)\n## Meet our department faculty\n|  ## [Amy Banić ](https://www.uwyo.edu/eecs/faculty-staff/faculty/amy-banic/index.html)**Professor** EERB 435C abanic@uwyo.edu Computer Science  \n---|---  \n|  ## [Steve Barrett ](https://www.uwyo.edu/eecs/faculty-staff/faculty/Steven-Barrett/index.html)**Associate Dean Undergraduate Programs  \n** **Professor** EN 2076 steveb@uwyo.edu  \nElectrical and Computer Engineering  \n| \n## **[Sudipta Banerjee](https://www.uwyo.edu/eecs/faculty-staff/faculty/sudipta-banerjee.html)**\n**Assistant****Professor** EN 4081B sbanerj3@uwyo.edu  \nComputer Science  \n| \n## Kim Buckner\n**Associate Lecturer** Remote kbuckner@uwyo.edu Computer Science  \n|  ## [Dongliang Duan ](https://www.uwyo.edu/eecs/faculty-staff/faculty/Dongliang-Duan/index.html)**Associate Professor** EN 5051 dduan@uwyo.edu Electrical and Computer Engineering  \n|  ## [Eva S. Ferre-Pikal ](https://www.uwyo.edu/eecs/faculty-staff/faculty/Eva-Ferre-Pikal/index.html)**Associate Professor** EN 5039 evafp@uwyo.edu Electrical and Computer Engineering  \n| \n## **[Nels Frazier](https://www.uwyo.edu/eecs/faculty-staff/faculty/nels-frazier.html)**\n**Temporary Lecturer** EN 4089 **nfrazie1@uwyo.edu** Computer Science  \n|  ## [Ruben Gamboa ](https://www.uwyo.edu/eecs/faculty-staff/faculty/ruben-gamboa/index.html)**Professor** EN 4071B ruben@uwyo.edu Computer Science  \n| \n## ## [Md Abul Hasnat ](https://www.uwyo.edu/eecs/faculty-staff/faculty/md-abul-hasnat.html)\n**Assistant Professor** EN 4091 mhasnat@uwyo.edu Electrical Engineering  \n| \n## ## [Robin Hill ](https://www.uwyo.edu/eecs/faculty-staff/faculty/robin-hill/index.html)\n**Temporary Lecturer** EN 5062 hill@uwyo.edu Computer Science  \n|  ## [John Hitchcock ](https://www.uwyo.edu/eecs/faculty-staff/faculty/john-hitchcock/index.html)**Professor** EN 4084A jhitchco@uwyo.edu Computer Science  \n|  ## [Murugeswari Issakkimuthu ](https://www.uwyo.edu/eecs/faculty-staff/faculty/murugeswari-issakkimuthu/index.html)**Assistant Lecturer** EN 4068 missakki@uwyo.edu Computer Science  \n| \n## ## [Hasan Iqbal ](https://www.uwyo.edu/eecs/faculty-staff/faculty/hasan-iqbal/index.html)\n**Assistant Professor** EN 5055 hasan.iqbal@uwyo.edu Computer Science  \n| \n## ## [Chao Jiang ](https://www.uwyo.edu/eecs/faculty-staff/faculty/chao-jiang/index.html)\n**Associate Professor** EN 5028 chao.jiang@uwyo.edu Electrical and Computer Engineering  \n| \n## **[Vinit Katariya](https://www.uwyo.edu/eecs/faculty-staff/faculty/vinit-katariya.html)**\n**Assistant****Professor** EN 4083\n##  vkatariy@uwyo.edu\nComputer Science  \n| \n## ## [Yaqoob Majeed ](https://www.uwyo.edu/eecs/faculty-staff/faculty/yaqoob-majeed/index.html)\n**Assistant Professor** EN 5032 ymajeed@uwyo.edu Electrical and Computer Engineering  \n| \n## ## [John E. McInroy ](https://www.uwyo.edu/eecs/faculty-staff/faculty/John-McInroy/index.html)\n**Professor** EN 5015 mcinroy@uwyo.edu Electrical and Computer Engineering  \n| \n## ## [Suresh S. Muknahallipatna ](https://www.uwyo.edu/eecs/faculty-staff/faculty/Suresh-Muknahallipatna/index.html)\n**Professor** EN 5059 sureshm@uwyo.edu Electrical and Computer Engineering  \n| \n## ## [Duong Ngoc Nguyen ](https://www.uwyo.edu/eecs/faculty-staff/faculty/duong-nguyen/index.html)\n**Assistant Professor** EN 5060  duong.nguyen@uwyo.edu Computer Science  \n| \n## **[Nga Nguyen](https://www.uwyo.edu/eecs/faculty-staff/faculty/nga-nguyen/index.html)**\n**Associate Professor** EN 5048 nga.nguyen@uwyo.edu Electrical and Computer Engineering  \n| \n## ## [John F. O'Brien ](https://www.uwyo.edu/eecs/faculty-staff/faculty/John-O-Brien/index.html)\n**Associate Professor** EN 5034 obrienj@uwyo.edu Electrical and Computer Engineering  \n| \n## ## [Laura Oler ](https://www.uwyo.edu/eecs/faculty-staff/faculty/laura-oler/index.html)\n**Assistant Lecturer** EN 5056 loler1@uwyo.edu Electrical and Computer Engineering   \n| \n## ## [Jon M. Pikal ](https://www.uwyo.edu/eecs/faculty-staff/faculty/Jon-Pikal/index.html)\n**Associate Professor** EN 5014 jpikal@uwyo.edu Electrical and Computer Engineering  \n| \n## ## [Danny Radosevich ](https://www.uwyo.edu/eecs/faculty-staff/faculty/danny-radosevich/index.html)\n**Assistant Lecturer** EN 4074 dradose1@uwyo.edu Computer Science  \n| \n## ## [Shivanand Venkanna Sheshappanavar ](https://www.uwyo.edu/eecs/faculty-staff/faculty/shivanand.html)\n**Assistant Professor** EN 5035 ssheshap@uwyo.edu Computer Science  \n| \n## ## [Diksha Shukla ](https://www.uwyo.edu/eecs/faculty-staff/faculty/diksha-shukla/index.html)\n**Associate Professor** EERB 422A dshukla@uwyo.edu Computer Science  \n| \n## **[Ian Walker](https://www.uwyo.edu/eecs/faculty-staff/faculty/ian-walker/index.html)**\n**Department Head |****Professor** EN 5068B\n##  iwalker2@uwyo.edu\nElectrical Engineering and Computer Science  \n| \n## [**Yibo Wang**](https://www.uwyo.edu/eecs/faculty-staff/faculty/yibo-wang.html)\n**Assistant****Professor** EERB 422B\n##  ywang34@uwyo.edu\nComputer Science  \n| \n## ## [Jim Ward ](https://www.uwyo.edu/eecs/faculty-staff/faculty/james-ward/index.html)\n**Lecturer** **System Administrator** EN 4065 seker@uwyo.edu Computer Science  \n| \n## ## [Cameron H.G. Wright ](https://www.uwyo.edu/eecs/faculty-staff/faculty/Cameron-Wright/index.html)\n**Professor** EN 5052 chgw@uwyo.edu Electrical and Computer Engineering  \n| \n## ## [Zejian Zhou ](https://www.uwyo.edu/eecs/faculty-staff/faculty/zejian-zhou/index.html)\n**Assistant Professor** EN 5036 **zejian.zhou@uwyo.edu ** Electrical and Computer Engineering  \n## MEET OUR POSTDOCTORAL RESEARCHERS\n| \n## [**Judith Nkechinyere Njoku**](https://www.uwyo.edu/eecs/faculty-staff/faculty/judith-nkechinyere-njoku.html \"Judith Nkechinyere Njoku\")\nDistinguished Postdoctoral Fellow Secure Sensing & Learning (SSL) Research Lab EERB 422B jnjoku@uwyo.edu  \n---|---  \n| \n## [Xiao Yang](https://www.uwyo.edu/eecs/faculty-staff/faculty/xiao-yang.html \"Xiao Yang\")\n**Postdoctoral Research Associate** EN 4079A\n## xyang7@uwyo.edu  \n## Meet our staff\n| \n## [**Amanda Schneider**](https://www.uwyo.edu/eecs/faculty-staff/faculty/staff/office-associate-senior/index.html \"Office Associate\")\n**Office Associate, Senior** EN 5068 aschnei5@uwyo.edu  \n---|---  \n| \n## ## [James Branscomb ](https://www.uwyo.edu/eecs/faculty-staff/faculty/staff/james-branscomb/index.html)\n**Engineer, Senior** EN 5045\n## jbransc1@uwyo.edu  \n[For Faculty Research click here](https://www.uwyo.edu/eecs/research/index.html)\n## Contact Us\n### Department of Electrical Engineering and Computer Science\nEngineering Building\n  * Room 5068\n  * 1000 E. University Ave\n  * Laramie, WY 82071\n  * Dept. 3315\n  * Email: eecs@uwyo.edu\n  * Phone: [(307) 766-2279](tel:307-766-2279)\n\n\nThe University of Wyoming has earned its Research Level 1 (R1) status from the Carnegie Classification of Institutions of Higher Education, placing Wyoming's only four-year university with the [top research universities](https://www.uwyo.edu/research/index.html) in the United States.\n",
        "url_3": "## We value your privacy\nThe University of Wyoming uses cookies to enhance your browsing experience, serve personalized ads or content, and analyze our traffic. By clicking \"Accept All\", you consent to our use of cookies. You may withdraw your consent at any time by clicking the small icon at the bottom left corner of the website. [UW Privacy & Cookie Policy](https://www.uwyo.edu/uw/disclaimer.html)\nAccept all Decline all powered by: [Cookie Information](https://cookieinformation.com/)\n* Functional\n* Statistical\n* Marketing\n# Want to Learn More About UW?\n## Get the Details You Need to Make an Informed Decision\nBy requesting more information, you'll gain access to essential details about admissions, academic programs, student life and campus resources. Whether you're a first-year, transfer, international, or graduate student, we have tailored materials to help you explore your options. You can also download our viewbooks for an in-depth look at what UW has to offer. Fill out the request form to receive personalized information and take the next step toward becoming a Cowboy!\n[REQUEST INFOrmation](https://www.uwyo.edu/admissions/request-information/index.html#request)\nNavigation [ Main Page ](https://www.uwyo.edu/admissions)\n[Undergraduate Students](https://uwyo-erx.my.salesforce-sites.com/leads/apex/ERx_Forms__PageMaker?pageId=Undergraduate&UW=UG)\n[Graduate Students](https://uwyo-erx.my.salesforce-sites.com/leads/apex/ERx_Forms__PageMaker?pageId=Graduate&UW=Grad)\n[International Students](https://uwyo-erx.my.salesforce-sites.com/leads/apex/ERx_Forms__PageMaker?pageId=Undergraduate&UW=INTL)\n[Online Students](https://uwyo-erx.my.salesforce-sites.com/leads/apex/ERx_Forms__PageMaker?pageId=UWOnline&amp;uw=online)\n[Non-Degree Students](https://uwyo-erx.my.salesforce-sites.com/leads/apex/ERx_Forms__PageMaker?pageId=Undergraduate&UW=UG)\n[FIRST-YEAR Viewbook](https://issuu.com/uwyo/docs/undergrad_viewbook)\nLearn what our students love about UW. Explore fun facts, traditions and student opportunities waiting for you here at UW!\n[INTERNATIONAL Viewbook](https://issuu.com/uwyo/docs/international_viewbook)\nDid you know UW is the academic home to over 500 international students from across the globe? Explore why they chose UW and see what it has in store for you. \n[TRANSFER viewbook](https://issuu.com/uwyo/docs/transfer-viewbook)\nDiscover the transfer process, credit evaluations and support available to ensure a seamless transition to UW.\n[GRADUATE viewbook](https://issuu.com/uwyo/docs/uwyo_graduate_education_view_book)\nGet detailed information on graduate programs, research opportunities and the resources available to support your academic journey at UW.\n### Get the Facts\nExplore our downloadable viewbook brochures to get an in-depth look at life at the University of Wyoming. We’ve created brochures tailored to first-year, transfer, international and graduate students. These brochures provide essential facts, academic insights, student life details and a breakdown of the programs and resources available to help you succeed. Whether you’re just starting your college journey or continuing your education, these resources are designed to give you all the information you need to make an informed decision.\n## Request Your Personalized UW Info\n### Undergraduate Students\nRequest information about becoming a first-year or transfer student at UW, including admissions, academic programs and campus life. Fill out the form to receive detailed information.\n[Request Info](https://uwyo-erx.my.salesforce-sites.com/leads/apex/ERx_Forms__PageMaker?pageId=Undergraduate&UW=UG)\n### Graduate Students\nFill out the form to request information about UW’s graduate programs, application processes and resources available to support your academic journey.\n[Request Info](https://uwyo-erx.my.salesforce-sites.com/leads/apex/ERx_Forms__PageMaker?pageId=Graduate&UW=Grad)\n### Online & Continuing Education\nComplete the form to learn more about UW’s online programs and continuing education options tailored to working professionals.\n[Request Info](https://uwyo-erx.my.salesforce-sites.com/leads/apex/ERx_Forms__PageMaker?pageId=UWOnline&uw=online)\n### Explore Over 200 Degree Programs\nWith more than 200 undergraduate and graduate programs, UW offers a diverse range of academic opportunities. Students benefit from close faculty interaction, hands-on learning and research experiences both in state-of-the-art facilities and the vast Wyoming landscape. Many programs also provide options for study abroad and undergraduate research, helping you build real-world skills for your future. Discover the right path for you by exploring our degree and program finder.\n[Explore Degrees](https://www.uwyo.edu/uw/degree-programs/index.html)\n## Experience UW For yourself\nVisiting campus is the best way to see if UW is the right fit for you! Whether you explore in person or virtually, we offer multiple ways to connect. Take a guided campus tour, set up a one-on-one meeting with an admissions representative, or explore campus through our virtual tour. Located in the heart of the Mountain West, UW offers a welcoming environment and breathtaking surroundings. Discover what makes our university special and start planning your visit today!\n[Visit Campus](https://www.uwyo.edu/admissions/visit/index.html)\n## Contact Us\n### UW Office of Admissions\nKnight Hall\n  * Room 150\n  * 1000 E. University Ave\n  * Laramie, WY 82071\n  * Dept. 3435\n  * Toll Free: (800) 342-5996\n  * Email: admissions@uwyo.edu\n  * Phone: [(307) 766-5160](tel:307-766-5160)\n  * [UW Student Blog](https://www.uwyo.edu/blog/index.html)\n\n\nThe University of Wyoming has earned its Research Level 1 (R1) status from the Carnegie Classification of Institutions of Higher Education, placing Wyoming's only four-year university with the [top research universities](https://www.uwyo.edu/research/index.html) in the United States.\n",
        "url_4": "## We value your privacy\nThe University of Wyoming uses cookies to enhance your browsing experience, serve personalized ads or content, and analyze our traffic. By clicking \"Accept All\", you consent to our use of cookies. You may withdraw your consent at any time by clicking the small icon at the bottom left corner of the website. [UW Privacy & Cookie Policy](https://www.uwyo.edu/uw/disclaimer.html)\nAccept all Decline all powered by: [Cookie Information](https://cookieinformation.com/)\n* Functional\n* Statistical\n* Marketing\n# Visit the University of Wyoming\n## Find Your Place at UW\nVisiting campus is the best way to picture yourself at the University of Wyoming. Whether you join us for an in-person tour, a drop-in visit, or a virtual experience, you'll get a real feel for student life. Explore our residence halls, connect with current students and meet with [admissions representatives](https://www.uwyo.edu/admissions/counselors/index.html) who can answer all your questions. Plus, discover Laramie—a lively, welcoming college town in the heart of the Mountain West. Start planning your visit today and take the first step toward your future as a Cowboy!\n[Schedule a Visit](https://www.uwyo.edu/admissions/visit/weekday-visits/index.html)\nNavigation [ Main Page ](https://www.uwyo.edu/admissions)\nWeekday Visits\n[LEARN MORE](https://www.uwyo.edu/admissions/visit/weekday-visits/index.html)[Walk-In Tours ](https://www.uwyo.edu/admissions/visit/weekday-visits/daily-drop-in.html)[Group Visits](https://www.uwyo.edu/admissions/visit/weekday-visits/group-visits.html)\nAdmissions Events\n[LEARN MORE](https://www.uwyo.edu/admissions/visit/events/index.html)[New Student Days](https://www.uwyo.edu/admissions/visit/events/new-student-day.html)[Campus Pass](https://www.uwyo.edu/admissions/visit/events/campus-pass.html)[Discovery Day](https://www.uwyo.edu/admissions/visit/events/discovery-days.html)[UW Showcase](https://www.uwyo.edu/admissions/visit/events/uw-showcase.html)[Signing Day](https://www.uwyo.edu/admissions/visit/events/signing-day.html)[Transfer 101 Virtual Event](https://www.uwyo.edu/admissions/visit/events/transfer-101.html)[Summer Webinar Series](https://www.uwyo.edu/admissions/visit/events/summer-webinar.html)[Cowboy Webinar Series](https://www.uwyo.edu/admissions/visit/events/cowboy-webinars.html)\n[Take a Virtual Tour](https://www.uwyo.edu/uw/virtualtour.html)\n[Plan Your Visit to Laramie](https://www.uwyo.edu/admissions/visit/plan-your-visit.html)\n[K-12 Camps](https://www.uwyo.edu/admissions/visit/camps.html)\n## Visit Your Way\n### Admissions Events\nWhether you're still exploring options or already admitted, we have events to get you familiar with campus and ready to start your journey at UW.\n[Upcoming EVENTS](https://www.uwyo.edu/admissions/visit/events/index.html)\n### Walk-In Tours\nNo reservation? No problem! Join a student-led campus tour at 2:00 p.m. on weekdays. See campus and get a feel for student life with a relaxed, flexible visit.\n[Learn More](https://www.uwyo.edu/admissions/visit/weekday-visits/daily-drop-in.html)\n### Virtual Campus Tour\nExplore our beautiful UW campus from anywhere! Take an interactive virtual tour to see campus highlights and get a feel for student life.\n[Explore Virtually](https://www.uwyo.edu/uw/virtualtour.html)\n### Discover the Beauty of UW\nWelcome to one of the most stunning campuses in the Mountain West! At UW, you'll find a perfect mix of historic charm and modern spaces, all surrounded by breathtaking Wyoming landscapes. Stroll through tree-lined walkways, study in cozy outdoor spots, or explore cutting-edge facilities like the Half Acre Recreation Center and Coe Library. Whether you're taking in the crisp mountain air or enjoying campus traditions, UW is more than a place to learn—it’s a place to experience.\n## Explore Campus Housing\nPrevious\n[Legacy Hall - Suite](https://www.youtube.com/watch?v=wBjsBTnjFwI)\nA larger living space with shared amenities, offering more privacy while keeping the community feel.\n[Tobin House](https://www.uwyo.edu/living/housing/residence-halls/tobin-house.html)\nProvides a unique living experience with the Honors College, fostering academic and social engagement.\n[Fraternity & Sorority Life](https://www.uwyo.edu/fsl/index.html)\nGreek life housing offers a unique experience with built-in community, leadership and support.\n[North Hall - Double Room](https://www.tours.vividmediany.com/3d-model/uwyo-north-traditional-double/fullscreen/)\nThe most common option in a modern setting. A great choice for comfort, connection and availability.\n[North Hall - Double Room Private Bath](https://www.tours.vividmediany.com/3d-model/uwyo-north-double-suite-private/fullscreen/)\nA shared space for two complete with a private bathroom. Enjoy convenience and added comfort.\n[North Hall - Double Room Shared Bath](https://www.tours.vividmediany.com/3d-model/uwyo-north-double-suite-shared/fullscreen/)\nA two-person room plus a bathroom shared with another double room. Perfect for balancing privacy and community.\n[North Hall - Single Room](https://www.tours.vividmediany.com/3d-model/uwyo-north-single/fullscreen/)\nA private space ideal for those who value independence while staying connected to hall life.\n[Legacy Hall - Double Room](https://www.youtube.com/watch?v=eAZ1CYnSgUQ)\nA shared space with two beds, desks and storage. Perfect for building friendships in a lively setting.\n[Legacy Hall - Single Room](https://www.youtube.com/watch?v=6kNc_ou7gOM)\nEnjoy a private room with your own space while still being part of the vibrant residence hall community.\n[Legacy Hall - Suite](https://www.youtube.com/watch?v=wBjsBTnjFwI)\nA larger living space with shared amenities, offering more privacy while keeping the community feel.\n[Tobin House](https://www.uwyo.edu/living/housing/residence-halls/tobin-house.html)\nProvides a unique living experience with the Honors College, fostering academic and social engagement.\n[Fraternity & Sorority Life](https://www.uwyo.edu/fsl/index.html)\nGreek life housing offers a unique experience with built-in community, leadership and support.\n[North Hall - Double Room](https://www.tours.vividmediany.com/3d-model/uwyo-north-traditional-double/fullscreen/)\nThe most common option in a modern setting. A great choice for comfort, connection and availability.\n[North Hall - Double Room Private Bath](https://www.tours.vividmediany.com/3d-model/uwyo-north-double-suite-private/fullscreen/)\nA shared space for two complete with a private bathroom. Enjoy convenience and added comfort.\n[North Hall - Double Room Shared Bath](https://www.tours.vividmediany.com/3d-model/uwyo-north-double-suite-shared/fullscreen/)\nA two-person room plus a bathroom shared with another double room. Perfect for balancing privacy and community.\n[North Hall - Single Room](https://www.tours.vividmediany.com/3d-model/uwyo-north-single/fullscreen/)\nA private space ideal for those who value independence while staying connected to hall life.\n[Legacy Hall - Double Room](https://www.youtube.com/watch?v=eAZ1CYnSgUQ)\nA shared space with two beds, desks and storage. Perfect for building friendships in a lively setting.\n[Legacy Hall - Single Room](https://www.youtube.com/watch?v=6kNc_ou7gOM)\nEnjoy a private room with your own space while still being part of the vibrant residence hall community.\n[Legacy Hall - Suite](https://www.youtube.com/watch?v=wBjsBTnjFwI)\nA larger living space with shared amenities, offering more privacy while keeping the community feel.\n[Tobin House](https://www.uwyo.edu/living/housing/residence-halls/tobin-house.html)\nProvides a unique living experience with the Honors College, fostering academic and social engagement.\n[Fraternity & Sorority Life](https://www.uwyo.edu/fsl/index.html)\nGreek life housing offers a unique experience with built-in community, leadership and support.\nNext\n### UW Admissions Events\nDiscover the University of Wyoming through a variety of events tailored for prospective and admitted students. From on-campus experiences like New Student Days to virtual webinars covering admissions and financial aid, there's an opportunity for everyone to connect with UW and prepare for their journey as a Cowboy.\n[Explore Events](https://www.uwyo.edu/admissions/visit/events/index.html)\n## Where Tradition Meets Innovation\nDiscover what makes UW unique—where history, innovation and the Cowboy spirit come together. From its high-altitude setting to its rich heritage, every detail reflects the essence of Wyoming’s university.\n2060\nAcres make up UW's campus in the heart of Laramie.\n1886\nMarks the founding of UW. Historic charms remain, but innovations continue to push it forward.\n7220\nFeet above sea level, UW is one of the highest campuses—offering a true mountain experience.\n[Explore Campus Maps](https://www.uwyo.edu/uw/maps/index.html)\nFind your way around UW with our interactive maps! Explore academic buildings, dining spots and residence halls before you even step foot on campus.\n[Plan Your Laramie Trip](https://www.uwyo.edu/uw/aboutuw/about-laramie.html)\nMake the most of your visit! Discover local dining, outdoor adventures and things to do while you're in town to get a true feel for life in Laramie.\n[Parking at UW](https://www.uwyo.edu/admissions/visit/plan-your-visit.html#parking)\nKnow where to park before you arrive! Get details on visitor parking, permit options and the best spots to make your campus visit smooth and stress-free.\n[Lodging Options](https://www.uwyo.edu/admissions/visit/plan-your-visit.html#hotels)\nFind the perfect place to stay! Check out hotels, special rates and accommodations near UW to make your visit comfortable and convenient.\nBring Your Group to UW\nPlanning to bring a group to the University of Wyoming? We offer tailored campus visits for schools and organizations, including tours and admissions presentations. Please schedule at least three weeks in advance.\n[Schedule a Group Visit](https://www.uwyo.edu/admissions/visit/weekday-visits/group-visits.html)\n## Contact Us\n### UW Campus Visitor Center\nRoss Hall\n  * 1000 E. University Ave\n  * Laramie, WY 82071\n  * Dept. 3435\n  * Toll Free: (800) 342-5996\n  * Email: visituw@uwyo.edu\n  * Phone: [(307) 766-4075](tel:307-766-4075)\n  * [UW Student Blog](https://www.uwyo.edu/blog/index.html)\n\n\nThe University of Wyoming has earned its Research Level 1 (R1) status from the Carnegie Classification of Institutions of Higher Education, placing Wyoming's only four-year university with the [top research universities](https://www.uwyo.edu/research/index.html) in the United States.\n",
        "url_5": "## We value your privacy\nThe University of Wyoming uses cookies to enhance your browsing experience, serve personalized ads or content, and analyze our traffic. By clicking \"Accept All\", you consent to our use of cookies. You may withdraw your consent at any time by clicking the small icon at the bottom left corner of the website. [UW Privacy & Cookie Policy](https://www.uwyo.edu/uw/disclaimer.html)\nAccept all Decline all powered by: [Cookie Information](https://cookieinformation.com/)\n* Functional\n* Statistical\n* Marketing\n# Electrical Engineering\n## Doctor of Philosophy (Ph.D.)\n[Apply Now](https://www.uwyo.edu/admissions/apply.html)[Visit Campus](https://www.uwyo.edu/admissions/visit/index.html)\n## Energize Your Career with a Ph.D. in Electrical Engineering\nWhat if augmented reality could improve rural health care? Or had faster weather forecasts? Use theory, algorithms and systems (such as robots or drones) for making intelligent decisions in complex and uncertain environments.\n_**What questions would you ask given the opportunity?**_\nIn UW's ground-breaking Ph.D. program in electrical engineering, you will have the chance to work with world-class faculty who are asking and answering questions that will change the future - and who will empower you to do the same.\n[ Request Info ](https://www.uwyo.edu/admissions/request-information/index.html)\nThis program is currently offered in   \nthe following locations: \nLaramie Campus\n## About Electrical Engineering at UW\n###  Program Overview \nOur small graduate electrical engineering program offers an individualized research and academic experience where you can develop as an engineer and scholar, working closely with renowned faculty across a spectrum of topics including emerging computing technologies, power systems and green energy, robotics and computer vision. Graduates from our electrical engineering doctoral degree program go on to academic positions, research careers and leadership roles in industry.\n###  Concentrations \n**Choose a concentration in one of six areas:**\n  * Bio-Engineering\n  * Controls\n  * Electrical Energy Systems\n  * Electronic Systems and Devices\n  * Robotics\n  * Signal Processing and Computer Networks\n\n\n###  Courses & Curriculum \n## Electrical Engineering, Ph.D.\nTrains students to conduct research on innovative topics using cutting-edge tools and resources. Areas of foci include: Computer Vision, Controls, Electrical Energy Systems, IoT, AI, and Robotics and Signal Processing.\n### Degree Requirements\nPh.D. Degree Requirements:\nPh.D. Credit Allocation (all at 4000 level minimum)\n  * 72 hours (minimum) of acceptable graduate coursework\n  * 42 hours (minimum) from ECE and closely related formal course work ([ EE 5980 - Dissertation Research ](https://acalogcatalog.uwyo.edu/preview_course_nopop.php?catoid=16&coid=172853) not counting toward this minimum)\n\n\nOf those 42 hours, no more than 12 hours can be at the 4000 level\nCourses required by the department bachelor of science degree may not be applied for graduate credit\n  * 6 hours (maximum) of [ EE 4800 - Problems in _____ ](https://acalogcatalog.uwyo.edu/preview_course_nopop.php?catoid=16&coid=172814) can be counted for program of study credit\n  * 6 hours (maximum) of EE 5880 - Problems in ... can be counted for program of study credit\n  * 9 hours (maximum) of [ EE 5600 - Statistical Signal Processing in: ](https://acalogcatalog.uwyo.edu/preview_course_nopop.php?catoid=16&coid=172833) can be counted for program of study credit.\n\n\nIn addition to the minimum requirements of the university, doctoral students must pass a written and oral comprehensive examination, part of which is a written proposal explaining their planned dissertation research. The student after completing successfully the oral comprehensive examination and before defending the completed dissertation must present their research work at an ECE department seminar. The student must also present and defend a completed dissertation. Programs of study, including coursework and any research tools, are arranged by consultation between the students and their graduate committee. \n## Electrical Engineering Doctoral Degree Program Highlights\nSelect a Highlight\nOutstanding Faculty  Sample Electrical Engineering Dissertation Titles  Assistantships  Exceptional Facilities \nOutstanding Faculty \nCollaborate with electrical engineering faculty who are developing and testing technologies that will change lives. Electrical engineering faculty have been funded by organizations such as NASA, NIH and NSF.\n[Meet Our Faculty](https://www.uwyo.edu/eecs/faculty-staff/index.html \"Learn more about our faculty\")\n  * \"Multimodal data analysis for adaptive, personalized affect-aware systems in solo and competitive tasks\"\n  * \"Synchrophasor measurement application to modal analysis and forced oscillation detection and source localization\"\n  * \"Improving efficiency of wireless networks using network optimized beamforming, virtual terrain leveling and high-performance computing\"\n  * \"Framework for parallelization of programs on GPUs\"\n\n\nQualify for a research or teaching assistantship. Most electrical engineering graduate students receive funding as research or teaching assistants.\nThe UW Department of Electrical Engineering and Computer Science (EECS) has 10 active research laboratories that are updated regularly. They include electronics, circuits, digital design, microprocessor labs and others.\n[EECS Facilities](https://www.uwyo.edu/eecs/about/index.html \"Learn more about E.E.C.S. facilities\")\nOutstanding Faculty \n### Select a Highlight\nOutstanding Faculty  Sample Electrical Engineering Dissertation Titles  Assistantships  Exceptional Facilities \n## What can you do with an electrical Engineering Ph.D. degree?\nWhat jobs and careers are available with a Ph.D. in electrical engineering? \n  * Principal/Senior Electrical Engineer\n  * Research Scientist\n  * Associate Professor/Academic Program Coordinator\n  * Senior/Principal Algorithm Engineer\n  * Assistant Professor\n  * Programme Leader\n  * Senior Systems Engineer\n\n\nWhere are UW’s electrical engineering alumni working? \n  * Haliburton\n  * NASA Ames Research Center\n  * Las Alamos National Laboratory\n  * Oakland University\n  * Automated Truck Research and Development Center at Daimler Trucks North\n  * America\n  * Yanghou University\n  * University of Aberdeen\n  * General Motors\n\n\nWhat can I expect from the Ph.D. program in electrical engineering at UW? \nThe Ph.D. program in electrical engineering at UW offers a collaborative and supportive environment for advanced study and research in core areas of the field, including machine learning, assistive technologies, cybersecurity and power systems. Our graduates are in highly sought-after and consistently secure impressive positions after graduation.\nWhat industries are actively seeking to hire electrical engineering Ph.D. graduates? \nIndustries actively hiring electrical engineers with a master’s degree include:\n  * Tech\n  * Academia\n  * Aerospace\n  * Renewable energy\n  * Robotics\n  * Telecommunications\n  * Automotive\n  * Defense\n  * Healthcare & Medical Devices\n  * Manufacturing & Industrial Automation\n  * Power & Utilities\n  * Transportation & Infrastructure\n  * Consulting & Engineering Services\n  * Artificial Intelligence & Machine Learning\n\n\n“The biggest take-away message would be that no matter if you start at Stanford or UW, if you work hard and surround yourself with successful and well-connected people, you can do, be, go anywhere.\"\n- Maja Gorsk | Electrical Engineering Ph.D. '19\n[Apply Now](https://www.uwyo.edu/admissions/apply.html)[Visit Campus](https://www.uwyo.edu/admissions/visit/index.html)[Request Info](https://uwyo-erx.my.salesforce-sites.com/leads/apex/ERx_Forms__PageMaker?pageId=Graduate&amp;amp;UW=Grad)\n### Related Programs\nInterested in a doctoral degree in electrical engineering? You may be interested in these degrees as well:\n  * [M.S. in Electrical Engineering](https://www.uwyo.edu/uw/degree-programs/electrical-engineering-masters.html \"More information about the M.S. in Electrical Engineering\")\n  * [M.S. or Ph.D. in Computer Science](https://www.uwyo.edu/uw/degree-programs/computer-science-ms-phd.html \"More information about the M.S. or Ph.D. in Computer Science\")\n\n\nQuick Links\n[Tuition & Fees](https://www.uwyo.edu/sfa/cost-of-attendance/index.html \"View tuiton and fees information\")[Courses & Curriculum Information](https://acalogcatalog.uwyo.edu/preview_program.php?catoid=16&poid=17372&returnto=1485 \"View courses and curriculum information\")[Accreditation](https://www.abet.org/ \"View accreditation information\")\nDepartments\n[College of Engineering and Physical Sciences](https://www.uwyo.edu/ceps/index.html \"Learn more about the College of Engineering and Physical Sciences\")[Department of Electrical Engineering and Computer Science](https://www.uwyo.edu/eecs/about/index.html \"Learn more about the Department of Electrical Engineering and Computer Science\")\n## Contact Us\nCollege of Engineering and Physical Sciences\n  * Department of Electrical Engineering and Computer Science\n  * Department 3295, 1000 E. University Avenue\n  * Laramie, WY 82071\n  * Email: ece@uwyo.edu\n  * Phone: [(307) 766-2279](tel:307-766-2279)\n\n\nThe University of Wyoming has earned its Research Level 1 (R1) status from the Carnegie Classification of Institutions of Higher Education, placing Wyoming's only four-year university with the [top research universities](https://www.uwyo.edu/research/index.html \"Learn more about the research happening at the University of Wyoming\") in the United States.\n",
        "url_6": "# College of Engineering and Physical Sciences\n[ Apply Now ](https://www.uwyo.edu/admissions/index.html)[ Explore our Degrees ](https://www.uwyo.edu/uw/degree-programs/index.html)\nNavigation [ Main Page ](https://www.uwyo.edu/ceps)\nAcademic Programs\n[LEARN MORE](https://www.uwyo.edu/ceps/academics/index.html)[Undergraduate Programs](https://www.uwyo.edu/uw/degree-programs/index.html?programSearch=College+of+Engineering)[Graduate Programs](https://www.uwyo.edu/ceps/academics/graduate-programs.html)[Student Advising](https://www.uwyo.edu/ceps/academics/advising/index.html)[Honors Students](https://www.uwyo.edu/ceps/academics/honors/index.html)[Senior Design Symposium](https://www.uwyo.edu/ceps/academics/senior-design-symposium.html)[Admissions](https://www.uwyo.edu/ceps/academics/admissions.html)\n[Virtual Opportunities](https://www.uwyo.edu/ceps/virtual-opportunities.html)\nResearch\n[LEARN MORE](https://www.uwyo.edu/ceps/research/index.html)[Collaborate with Colleagues](https://www.uwyo.edu/ceps/research/collaborate-with-colleagues.html)\nAlumni and Friends\n[LEARN MORE](https://www.uwyo.edu/ceps/development/index.html)[Giving to the College](https://www.uwyo.edu/ceps/development/giving.html)[Awards and Recognition](https://www.uwyo.edu/ceps/development/awards/index.html)\nDean's Office\n[LEARN MORE](https://www.uwyo.edu/ceps/dean/index.html)[Office of the Dean](https://www.uwyo.edu/ceps/dean/index.html)[Mission Statement ](https://wwwnew.uwyo.edu/ceps/dean/Mission-Statement.html)[College Contacts ](https://www.uwyo.edu/ceps/dean/college-contacts.html)[CEPS Dean's Office Faculty & Staff](https://www.uwyo.edu/ceps/dean/faculty-staff.html)[CEPS Business Office](https://www.uwyo.edu/ceps/dean/business.html)[Faculty Council ](https://www.uwyo.edu/ceps/dean/faculty-council.html)[Staff Council ](https://www.uwyo.edu/ceps/dean/staff-council/index.html)[Academic Planning](https://wwwnew.uwyo.edu/ceps/dean/academic-planning.html)[Faculty Resources ](https://www.uwyo.edu/ceps/dean/resources.html)[Publications and News ](https://www.uwyo.edu/ceps/dean/publications/index.html)[FE Exam](https://www.uwyo.edu/ceps/dean/fe-exam.html)[ABET Accreditation](https://www.uwyo.edu/ceps/dean/Accreditation/index.html)\n[Faculty and Staff Directory](https://www.uwyo.edu/ceps/directory.html)\nUW Engineering Shop\n[LEARN MORE](https://www.uwyo.edu/ceps/shop/index.html)[What We Do](https://www.uwyo.edu/ceps/shop/whatwedo.html)[Capabilities](https://www.uwyo.edu/ceps/shop/capabilities.html)[Policies](https://www.uwyo.edu/ceps/shop/policies.html)[Student Projects](https://www.uwyo.edu/ceps/shop/students.html)[Shop Personnel](https://www.uwyo.edu/ceps/shop/staff.html)[SolidWorks](https://www.uwyo.edu/ceps/shop/solidworks.html)[Additional Resources](https://www.uwyo.edu/ceps/shop/resources.html)[Work Samples](https://www.uwyo.edu/ceps/shop/samples.html)[Work Request](https://form.jotform.com/uwyoshop/work-order)[UW Engineering Shop](https://www.uwyo.edu/ceps/shop/index.html)\n[Marketing and Communication Services](https://www.uwyo.edu/ceps/marketing-communication-services.html)\nStudent Resources\n[LEARN MORE](https://www.uwyo.edu/ceps/resources/index.html)[Center for Student Success ](https://www.uwyo.edu/ceps/resources/studentservices/index.html)[K-14 STEM Education Outreach Office](https://www.uwyo.edu/ceps/resources/outreach/index.html)[Current Students](https://www.uwyo.edu/ceps/resources/current-students/index.html)[Women in Engineering](https://www.uwyo.edu/ceps/resources/women-in-engineering.html)[Student Ambassadors](https://www.uwyo.edu/ceps/resources/ambassadors.html)[Computer Labs](https://www.uwyo.edu/ceps/resources/computer-labs/index.html)[Resources](https://www.uwyo.edu/ceps/resources/index.html)\n[Innovation](https://www.uwyo.edu/ceps/innovation.html)\n[Events Calendar](https://www.uwyo.edu/ceps/calendar.html)\nNews & Publications\n[LEARN MORE](https://www.uwyo.edu/ceps/news-and-publications/index.html)\n[Engineering Science](https://www.uwyo.edu/ceps/engineering-science.html)\n[Request More Information](https://www.uwyo.edu/ceps/request-information.html)\n## Begin Your Journey With Us\n###  Degrees & Programs \nAt the University of Wyoming College of Engineering and Physical Sciences, students are taught by a dedicated community of academic leaders who believe that interdisciplinary, diverse and inclusive education and research are all critical to our success in overcoming the challenges facing today’s world. The need for individuals within the STEM industries has never been greater and the College of Engineering and Physical Sciences is the right place at the right time for you to make a difference.\n[Find Your Degree](https://www.uwyo.edu/uw/degree-programs/index.html)\n[ABET Accreditation ](https://www.uwyo.edu/ceps/dean/Accreditation/index.html)   \n\nLearn how accreditation ensures quality and career readiness.\n###  Admissions & Scholarships \nThe College of Engineering and Physical Sciences offers 275+ scholarships yearly. Undergrads are admitted on a rolling basis; grad requirements vary by program. With low tuition and 55% graduating debt-free, UW is a top-value choice for an engineering or physical sciences degree.\n[Request Info](https://www.uwyo.edu/ceps/request-information.html)\nGet Started at UW\n[UW Admissions](https://www.uwyo.edu/admissions/index.html)[Engineering Scholarships](https://www.uwyo.edu/ceps/resources/studentservices/scholarships/index.html)[Financial Aid](https://www.uwyo.edu/sfa/scholarships/index.html)[Cost of Attendance](https://www.uwyo.edu/sfa/cost-of-attendance/index.html)[Graduate Requirements](https://www.uwyo.edu/admissions/graduate.html)[Virtual Tour](https://www.uwyo.edu/uw/virtualtour.html)\n[Visit Campus](https://www.uwyo.edu/admissions/visit/index.html)   \n\nExplore all that UW has to offer!\n###  Who We Are \nAt the College of Engineering and Physical Sciences, we’re driven by innovation, discovery and a commitment to shaping future leaders in science and engineering. Under the leadership of Carrell Family Dean, the Dean’s Office is dedicated to supporting students, faculty and staff across the University of Wyoming. \n[Our Mission](https://wwwnew.uwyo.edu/ceps/dean/Mission-Statement.html)\nLearn More\n[Dean's Office](https://www.uwyo.edu/ceps/dean/index.html)[Faculty & Staff Directory](https://www.uwyo.edu/ceps/directory.html)\n[Tier-1 Initiative ](https://www.uwyo.edu/ceps/engineering-initiative/)\nSee how we are achieving academic excellence and world-class research.\n[Student Career Services](https://www.uwyo.edu/ceps/resources/studentservices/jobs/students.html)\nInterested in an internship or job? Start your search with our Career Services team! \n[Study & Tutoring Resources](https://www.uwyo.edu/ceps/resources/current-students/tutoring.html)\nGet the help you need to succeed in even the toughest of classes. \n[Academic Advising](https://www.uwyo.edu/ceps/academics/advising/index.html)\nSet up a time with your academic advisor to stay on track with your degree. \n### Where Student Success Matters\nThe College of Engineering and Physical Sciences is dedicated to helping you succeed academically and professionally. Our personalized advising ensures you’re on track to meet your goals. Career services assist with job searches, internships, resume reviews and networking, connecting you to opportunities within the STEM field.\nThe College also offers tutoring services to support you in challenging courses. With these resources, we aim to provide comprehensive support for your academic and professional growth. Explore more at the Susan McCormack Center for Student Success.\n[Student SUCCESS CENTER](https://www.uwyo.edu/ceps/resources/studentservices/index.html)\n## Student Resources\nPrevious\n### Study Abroad\nChoose from hundreds of domestic and international destinations to pursue your degree. \n[Learn More](https://www.uwyo.edu/uwyoabroad/)\n### Engineering Science\nDiscover the core principles that form the backbone of engineering, no matter your specialty. \n[Check it Out](https://www.uwyo.edu/ceps/engineering-science.html)\n### Graduate Student Resources\nGet the need to know information as a graduate student in our college. \n[View Resources](https://www.uwyo.edu/ceps/academics/graduate-programs.html)\n### Student Orgs\nOur college offers dozens of student organizations to help you find your community and get involved.\n[View Organizations](https://www.uwyo.edu/ceps/resources/current-students/societies/index.html)\n### Study Abroad\nChoose from hundreds of domestic and international destinations to pursue your degree. \n[Learn More](https://www.uwyo.edu/uwyoabroad/)\n### Engineering Science\nDiscover the core principles that form the backbone of engineering, no matter your specialty. \n[Check it Out](https://www.uwyo.edu/ceps/engineering-science.html)\n### Graduate Student Resources\nGet the need to know information as a graduate student in our college. \n[View Resources](https://www.uwyo.edu/ceps/academics/graduate-programs.html)\n### Student Orgs\nOur college offers dozens of student organizations to help you find your community and get involved.\n[View Organizations](https://www.uwyo.edu/ceps/resources/current-students/societies/index.html)\n### Study Abroad\nChoose from hundreds of domestic and international destinations to pursue your degree. \n[Learn More](https://www.uwyo.edu/uwyoabroad/)\n### Engineering Science\nDiscover the core principles that form the backbone of engineering, no matter your specialty. \n[Check it Out](https://www.uwyo.edu/ceps/engineering-science.html)\n### Graduate Student Resources\nGet the need to know information as a graduate student in our college. \n[View Resources](https://www.uwyo.edu/ceps/academics/graduate-programs.html)\nNext\n## College of Engineering & Physical Sciences Departments\nBrowse by Department\nAtmospheric Science  Chemical and Biomedical Engineering  Chemistry  Civil and Architectural Engineering & Construction Management  Electrical Engineering and Computer Science  Energy and Petroleum Engineering  Geology and Geophysics  Mathematics and Statistics  Mechanical and Energy Systems Engineering  Physics and Astronomy  School of Computing \nAtmospheric Science \nExplore the science behind weather, climate and atmospheric phenomena. Students and researchers in this department use cutting-edge tools to study and model atmospheric systems that impact our life on Earth.\n[Learn More](https://www.uwyo.edu/atsc/index.html)\nThis department prepares students to innovate in chemical processes, biotechnology and biomedical devices. With strong industry ties and research opportunities, its where chemistry meets real-world problem-solving.\n[Learn More](https://www.uwyo.edu/chemical/index.html)\nFrom materials and energy to health and the environment, the Department of Chemistry is a hub for hands-on discovery. Students gain practical lab experience while working alongside expert faculty. \n[Learn More](https://www.uwyo.edu/chemistry/index.html)\nBuild your future with programs in civil engineering, architectural systems and construction management. This department focuses on infrastructure sustainability and project leadership.\n[Learn More](https://www.uwyo.edu/civil/index.html)\nDesign the future with skills in circuits, AI, cybersecurity, and software development. Students in this department tackle modern challenges through theory, lab work and innovation.\n[Learn More](https://www.uwyo.edu/eecs/index.html)\nFocused on efficient, sustainable resource extraction and energy systems, this department blends geoscience, engineering and technology to address global energy needs.\n[Learn More](https://www.uwyo.edu/petroleum/index.html)\nStudy Earth from core to crust with faculty-led research in natural resources, tectonics, seismology and more. Fieldwork and lab experience prepare students for geoscience careers.\n[Learn More](https://www.uwyo.edu/geolgeophys/index.html)\nSolve real-world problems through advanced mathematics and data analysis. Students learn critical thinking, modeling and computational skills essential in research and industry.\n[Learn More](https://www.uwyo.edu/mathstats/index.html)\nFrom robotics to renewable energy, this department equips students to design, test and innovate mechanical and energy systems for today’s and tomorrow’s challenges.\n[Learn More](https://www.uwyo.edu/mechanical/index.html)\nDive into the fundamental laws of nature and the mysteries of the universe. Students explore everything from quantum mechanics to galaxies through hands-on experiments and research.\n[Learn More](https://www.uwyo.edu/physics/index.html)\nThis interdisciplinary hub fosters innovation in computing, data science and digital systems. Students gain in-demand skills through applied projects and cross-campus collaboration.\n[Learn More](https://www.uwyo.edu/soc/index.html)\nAtmospheric Science \n### Browse by Department\nAtmospheric Science  Chemical and Biomedical Engineering  Chemistry  Civil and Architectural Engineering & Construction Management  Electrical Engineering and Computer Science  Energy and Petroleum Engineering  Geology and Geophysics  Mathematics and Statistics  Mechanical and Energy Systems Engineering  Physics and Astronomy  School of Computing \n### World Class Facilities\nThe Engineering Education and Research Building at the University of Wyoming is a state-of-the-art facility designed to foster innovation, collaboration and hands-on learning. As part of the Tier-1 Engineering Initiative, it supports workforce development and research tied to Wyoming’s economic future. Inside, you’ll find flexible labs, project spaces, active-learning classrooms, a drilling simulator and more—built for next-level engineering education.\n[Explore Facilities ](https://www.uwyo.edu/ceps/engineering-initiative/facilities.html)\n## Explore the Latest\nPrevious\n[Foresight Magazine](https://www.uwyo.edu/ceps/dean/publications/foresight.html)\nExplore stories of innovation, research highlights and student success from across the college in our latest issues of _Foresight_ Magazine.\n[CEPS Research](https://www.uwyo.edu/ceps/research/index.html)\nDiscover how CEPS researchers are addressing real-world challenges and driving innovation across disciplines and industries.\n[Innovation](https://www.uwyo.edu/ceps/innovation.html)\nLearn how CEPS fosters innovation through student projects, industry partnerships and entrepreneurial support.\n[Events Calendar](https://www.uwyo.edu/ceps/calendar.html)\nStay informed on upcoming events, seminars, career fairs and more happening in the College of Engineering and Physical Sciences.\n[Foresight Magazine](https://www.uwyo.edu/ceps/dean/publications/foresight.html)\nExplore stories of innovation, research highlights and student success from across the college in our latest issues of _Foresight_ Magazine.\n[CEPS Research](https://www.uwyo.edu/ceps/research/index.html)\nDiscover how CEPS researchers are addressing real-world challenges and driving innovation across disciplines and industries.\n[Innovation](https://www.uwyo.edu/ceps/innovation.html)\nLearn how CEPS fosters innovation through student projects, industry partnerships and entrepreneurial support.\n[Events Calendar](https://www.uwyo.edu/ceps/calendar.html)\nStay informed on upcoming events, seminars, career fairs and more happening in the College of Engineering and Physical Sciences.\n[Foresight Magazine](https://www.uwyo.edu/ceps/dean/publications/foresight.html)\nExplore stories of innovation, research highlights and student success from across the college in our latest issues of _Foresight_ Magazine.\n[CEPS Research](https://www.uwyo.edu/ceps/research/index.html)\nDiscover how CEPS researchers are addressing real-world challenges and driving innovation across disciplines and industries.\n[Innovation](https://www.uwyo.edu/ceps/innovation.html)\nLearn how CEPS fosters innovation through student projects, industry partnerships and entrepreneurial support.\nNext\n## \n## News and Featured Stories\n### New Agreement will Boost Enrollment in UW Department of Energy and Petroleum Engineering\n[Read More Stories](https://www.uwyo.edu/ceps/news-and-publications/index.html)\nNovember 17, 2025\nThe University of Wyoming Department of Energy and Petroleum Engineering recently entered into a five-year articulation agree...\n[Read the Story](https://www.uwyo.edu/news/2025/11/new-agreement-will-boost-enrollment-in-uw-department-of-energy-and-petroleum-engineering.html)\n## Recruiters & Employers\n[Corporate Partnerships](https://www.uwyo.edu/ceps/resources/studentservices/jobs/recruiters-and-employers.html)\nLeverage the expertise of the University's College of Engineering and Physical Sciences, through the dedicated Susan McCormack Center for Student Success Career Services Office. Our adept employer relations team is poised to seamlessly link your company with driven UW students and recent graduates pursuing entry-level roles and internships in science, technology, engineering and mathematics.\n## Resources & Numbers at a Glance\nThe College of Engineering and Physical Sciences combines a close-knit learning environment with meaningful support and opportunity. With small class sizes, generous scholarships and a strong student community, you'll have the resources and connections to succeed both academically and professionally.\n1,900+\nStudent enrolled at the College of Engineering & Physical Sciences\n20:1\nStudent-to-faculty ratio in the College of Engineering & Physical Sciences\n$6,400\nAverage amount of scholarship dollars per Engineering student.\n[Awards & Recognition](https://www.uwyo.edu/ceps/development/awards/index.html)\nWe're proud of our college's community and invite you to discover our accomplishments and awards. \n[K-12 Outreach](https://www.uwyo.edu/ceps/resources/outreach/index.html)\nThe K–12 STEM Education Outreach Office connects students and teachers with hands-on learning to spark interest in science, technology, engineering and math.\n[Alumni & Friends](https://www.uwyo.edu/ceps/development/index.html)\nOur alumni have made an impact all over the world. connect and find more opportunities to get involved!\n[Student Ambassadors](https://www.uwyo.edu/ceps/resources/ambassadors.html)\nOur student ambassadors are an integral part of discovering more about our programs and resources.\nSupport our Mission & students\nAt the College of Engineering and Physical Sciences, giving comes in many forms—and every contribution helps expand our impact. Your support enhances educational excellence, groundbreaking research and outreach that benefits Wyoming and the world.\n[Give To Uw](https://www.uwyo.edu/ceps/development/giving.html)\n## Contact Us\n### College of Engineering and Physical Sciences\nEngineering Education and Research Building (EERB)\n  * Room 401\n  * 1000 E. University Ave\n  * Laramie, WY 82071\n  * Dept. 3295\n  * Email: enginfo@uwyo.edu\n  * Phone: [(307) 766-4253](tel:307-766-4253)\n\n\nThe University of Wyoming has earned its Research Level 1 (R1) status from the Carnegie Classification of Institutions of Higher Education, placing Wyoming's only four-year university with the [top research universities](https://www.uwyo.edu/research/index.html) in the United States.\n",
        "url_7": "## We value your privacy\nThe University of Wyoming uses cookies to enhance your browsing experience, serve personalized ads or content, and analyze our traffic. By clicking \"Accept All\", you consent to our use of cookies. You may withdraw your consent at any time by clicking the small icon at the bottom left corner of the website. [UW Privacy & Cookie Policy](https://www.uwyo.edu/uw/disclaimer.html)\nAccept all Decline all powered by: [Cookie Information](https://cookieinformation.com/)\n* Functional\n* Statistical\n* Marketing\n# Cybersecurity\n## Undergraduate Certificate\n[Apply Now](https://www.uwyo.edu/admissions/apply.html)[Visit Campus](https://www.uwyo.edu/admissions/visit/index.html)\n## Help solve the cybersecurity issues of today with a certificate from UW\nStudents pursuing a cybersecurity certificate from the College of Engineering and Physical Sciences develop their technical foundations in the broad field. They learn about protecting information within interconnected systems. Research experience in our program offers opportunities to get valuable industry insight.\n[ Request Info ](https://www.uwyo.edu/admissions/request-information/index.html)\nThis program is currently offered in   \nthe following locations: \nLaramie Campus\n## What is Cybersecurity?\n###  Program Overview \nThe cybersecurity certificate program is housed in the Electrical Engineering and Computer Science (EECS) Department. Students study computer science, programming, networking, databases, security of systems and advanced topics! Through the program there’s access to specialized hardware and software specifically related to side channel evaluation and attacks.\n[Learn About EECS](https://www.uwyo.edu/eecs/index.html \"Learn more about the Department of Electrical Engineering and Computer Science\")   \n\nExplore all about UW's Electrical Engineering and Computer Science Department!\n###  Outstanding Faculty \nFaculty involved with the cybersecurity certificate have brought in millions of dollars from local, state, government and industry sources to help support students and community members in developing their cybersecurity skills. Professors like John Hitchcock have been dedicated to our department for years, bringing expertise to our classrooms. \n[Meet Our Faculty!](https://www.uwyo.edu/eecs/faculty-staff/index.html \"Learn more about our faculty\")   \n\nLearn more about our knowledgeable computer science faculty.\n###  Course Requirements \n## Cybersecurity Certificate\nCybersecurity is the practice of ensuring the confidentiality, integrity, and availability of information within interconnected systems. The certificate in Cybersecurity prepares you for a career securing software-intensive systems.\n### Requirements\n  * [COSC 2030 - Data Structures ](https://acalogcatalog.uwyo.edu/preview_course_nopop.php?catoid=16&coid=168930)\n  * [COSC 4010 - Special Topics in Computer Science ](https://acalogcatalog.uwyo.edu/preview_course_nopop.php?catoid=16&coid=168944)(3 credits required for certificate) \n  * [COSC 4760 - Computer Networks ](https://acalogcatalog.uwyo.edu/preview_course_nopop.php?catoid=16&coid=168961)\n  * [COSC 3765 - Computer Security ](https://acalogcatalog.uwyo.edu/preview_course_nopop.php?catoid=16&coid=168962)\n  * [COSC 4820 - Database Systems ](https://acalogcatalog.uwyo.edu/preview_course_nopop.php?catoid=16&coid=168965)\n  *   *   * STAT 2010 Credits: 4\n  * **OR**\n  * [STAT 2050 - Fundamentals of Statistics ](https://acalogcatalog.uwyo.edu/preview_course_nopop.php?catoid=16&coid=172311)\n  * **OR**\n  * [STAT 2070 - Introductory Statistics for the Social Sciences ](https://acalogcatalog.uwyo.edu/preview_course_nopop.php?catoid=16&coid=172312)\n  * **OR**\n  * [STAT 4220 - Basic Engineering Statistics ](https://acalogcatalog.uwyo.edu/preview_course_nopop.php?catoid=16&coid=172321)\n\n\n### Minimum Required: 20 Credits\nNote: [COSC 4760](https://acalogcatalog.uwyo.edu/preview_course_nopop.php?catoid=16&coid=168961) can also be replaced by the ECE version ECE 4870 or a second [COSC 4010 - Special Topics in Computer Science ](https://acalogcatalog.uwyo.edu/preview_course_nopop.php?catoid=16&coid=168944).\n## Cybersecurity Certificate Program Highlights\nSelect a Highlights\nExperiential Learning  Networking Opportunities  Flexibility  Financial Support \nExperiential Learning \nStudents may access various cybersecurity research groups including those in the Cybersecurity Education and Research (CEDAR) Center. Faculty have collaborated with dozens of student researchers who are now successfully published in major conferences, journals and magazines.\n[CEDAR](https://www.uwyo.edu/cedar/index.html \"Learn more about the Cybersecurity Education and Research \\(CEDAR\\) Center\")\nWhile any student can join, those in the certificate program have stronger ties to student organizations like Defense Against the Dark Arts or our women in Cybersecurity group, WiCys. These organizations bring students together to learn and connect.\n[Student Organizations](https://www.uwyo.edu/csil/student-orgs/index.html \"View our student organizations\")\nThe field of cybersecurity is constantly evolving, and flexible coursework allows students to adapt their learning experience to fit their needs and preferences. This can help students stay current with the latest developments in the field, which is crucial in the fast-paced and constantly changing world of cybersecurity.\nUW students may be eligible for a variety of scholarships and opportunities. There are several financial support options available for students pursuing a certificate in cybersecurity.\n[Scholarship Opportunities](https://www.uwyo.edu/sfa/scholarships/index.html \"Learn more about scholarship opportunities\")\nExperiential Learning \n### Select a Highlights\nExperiential Learning  Networking Opportunities  Flexibility  Financial Support \n## What can you do with a Cybersecurity Certificate?\nA cybersecurity certificate can open doors to roles like cybersecurity analyst, IT security specialist or network security technician. It’s also a great way to boost your resume if you’re in IT, business or computer science, giving you the skills to help protect data and stay ahead in a fast-growing field.\nWhat jobs and careers are available with a cybersecurity certificate? \n  * Cybersecurity Developer\n  * Cybersecurity Researcher\n  * Software Developer \n  * Information Security Analyst \n  * Cybersecurity Analyst\n  * Security Consultant\n  * Information Security Manager\n  * Network and Systems Administrator\n  * Cybersecurity Engineer\n  * Penetration Tester or Ethical Hacker\n  * Cybersecurity Auditor\n  * Cybersecurity Instructor or Trainer\n  * Cryptographer\n  * Chief Information Security Officer (CISO)\n\n\nWhere are UW’s cybersecurity alumni working? \n  * Microsoft\n  * Idaho National Labs\n  * Audible\n  * Snap\n  * University of Wyoming\n  * Carnegie Mellon University\n  * University of Utah\n  * Stanford University\n\n\nAre cybersecurity jobs in high demand? \nYes, cybersecurity jobs are in high demand and growing fast. With rising cyber threats and a global talent shortage, industries like tech, finance, health care and government are all hiring. It’s a great time to enter the field, with strong job security and career growth ahead.\nDoes earning a cybersecurity certificate make you more competitive in the job market? \nAbsolutely! Earning a cybersecurity certificate can make you more competitive in this competitive job market. It shows employers you have the skills to protect systems and data, which is crucial across industries. It’s especially valuable if you’re looking to break into tech or boost your current role.\n[Apply Now](https://www.uwyo.edu/admissions/apply.html)[Visit Campus](https://www.uwyo.edu/admissions/visit/index.html)[Request Info](https://uwyo-erx.my.salesforce-sites.com/leads/apex/ERx_Forms__PageMaker?pageId=Undergraduate&UW=UG)\n### Related Programs\nInterested in a cybersecurity certificate? You might also want to learn more about these undergraduate programs at UW:\n  * [B.S. in Computer Science](https://www.uwyo.edu/uw/degree-programs/computer-science-bachelors.html \"Learn more about the B.S. in Computer Science\")\n  * [B.S. in Computer Engineering](https://www.uwyo.edu/uw/degree-programs/computer-engineering-bachelors.html \"Learn more about the B.S. in Computer Engineering\")\n\n\nQuick Links\n[Tuition & Fees](https://www.uwyo.edu/sfa/cost-of-attendance/index.html \"View tuition and fees information\")[Courses & Curriculum Information](https://acalogcatalog.uwyo.edu/preview_program.php?catoid=16&poid=17360&returnto=1485 \"View courses and curriculum information\")\nDepartments\n[College of Engineering and Physical Sciences](https://www.uwyo.edu/ceps/index.html \"Learn more about the College of Engineering and Physical Sciences\")[Department of Electrical Engineering and Computer Science](https://www.uwyo.edu/eecs/index.html \"Learn more about the Department of Electrical Engineering and Computer Science\")\n## Contact Us\nElectrical Engineering and Computer Science Department\n  * Department 3295\n  * 1000 E. University Avenue\n  * Laramie, WY 82071\n  * Email: eecs@uwyo.edu\n  * Phone: [(307) 766-2279](tel:307-766-2279)\n\n\nThe University of Wyoming has earned its Research Level 1 (R1) status from the Carnegie Classification of Institutions of Higher Education, placing Wyoming's only four-year university with the [top research universities](https://www.uwyo.edu/research/index.html \"Learn more about the research happening at the University of Wyoming\") in the United States.\n",
        "url_8": "# Research and Economic Development Division\n## _Wyoming Relevant, Nationally Competitive,  \nGlobally Preeminent_\nThe University of Wyoming Research and Economic Development Division (REDD) advances research, service and innovation through interdisciplinary collaboration. By supporting faculty and student research, REDD drives economic growth and positions UW as a center of research excellence and real-world impact.\n[ About Us ](https://www.uwyo.edu/research/about/index.html)[ Resources ](https://www.uwyo.edu/research/support-and-resources/index.html)\n[FEDERAL FUNDING UPDATES](https://www.uwyo.edu/research/announcements/fundingupdates/index.html \"FEDERAL FUNDING UPDATES\")\nGuidance and FAQs. \n## Research & Economic Development at UW:\n###  For Researchers & Faculty \n  \n\nUW is proud to work alongside some of the nation’s most accomplished researchers and faculty. As a faculty member, graduate researcher or postdoc the Research and Economic Development Division provides you with the resources, guidance and support to secure funding and launch impactful research. \n[Learn more](https://www.uwyo.edu/research/researchers-and-faculty.html)\nExplore\n  * [EPSCoR and IDeA Office](https://www.uwyo.edu/research/centers-and-institutes/epscor/index.html)\n  * [Research Development Office](https://www.uwyo.edu/research/centers-and-institutes/epscor/grant-submissions/index.html \"Research Development Office\")\n  * [PreAward Services](https://www.uwyo.edu/research/support-and-resources/preaward-services.html \"PreAward Services\")\n  * [Integrity & Compliance](https://www.uwyo.edu/research/research-compliance/index.html)\n  * [Center for Entrepreneurship & Innovation](https://www.uwyo.edu/innovation/index.html)\n  * [Tech Transfer Office](https://www.uwyo.edu/research/economic-development/technology-transfer-office/index.html)\n  * [Economic Development Units](https://www.uwyo.edu/research/economic-development/index.html)\n  * [WYNDD](https://uwyo.edu/wyndd)\n  * [WYSAC](https://wysac.uwyo.edu/wysac/)\n\n\n  \nFind training opportunities:\n  * [Training Calendar](https://www.uwyo.edu/research/announcements/training-calendars.html)\n\n\n###  For Students \nUndergraduate and graduate students at UW can access our strong network of support to help you succeed in your research journey. The Research and Economic Development Division offers a wide range of resources, guidance and funding opportunities to help you develop your ideas, secure support and bring your research project to life.\n[Learn more](https://www.uwyo.edu/research/students.html)\nExplore\n  * [Research Development](https://www.uwyo.edu/research/centers-and-institutes/epscor/grant-submissions/index.html)\n  * [EPSCoR and IDeA Office](https://www.uwyo.edu/research/centers-and-institutes/epscor/index.html)\n  * [Center for Entrepreneurship & Innovation](https://www.uwyo.edu/innovation/index.html)\n  * [Research Centers & Institutes](https://www.uwyo.edu/research/centers-and-institutes/index.html)\n  * [Tech Transfer Office](https://www.uwyo.edu/research/economic-development/technology-transfer-office/index.html)\n  * [Economic Development Units](https://www.uwyo.edu/research/economic-development/index.html)\n\n\n###  Community & Partnerships \nUW is a key driver of workforce development and economic growth across Wyoming. Our faculty, students and partners contribute research, innovation and talent to meet real-world needs. We build strong partnerships with industry, public institutions and communities to create jobs, grow industries and support statewide prosperity.\n[Learn more](https://www.uwyo.edu/research/community.html)\nFind information on our partnerships:\n  * [Industry & Strategic Partnerships](https://www.uwyo.edu/oisp/)\n  * [Research Centers & Institutes](https://www.uwyo.edu/research/centers-and-institutes/index.html)\n  * [Economic Development](https://www.uwyo.edu/research/economic-development/index.html \"Economic Development\")\n\n\n### Research stats at UW:\n5,763\nUW Students were trained by LAMP-trained educators in active learning classes in FY24   \n\n$167.3 M\nTotal FY24 research expenditures   \n\nNo. 91\nOn NAI's annual list of patent production by U.S. universities\n## World-Class Facilities\nPrevious\n### NCAR-Wyoming\nThe National Center for Atmospheric Research (NCAR) Wyoming Research Supercomputing Center is a high-performance computing center and data archival center in Cheyenne.\n[Supercomputing Center](https://www.uwyo.edu/nwsc/index.html)\n### CASI\nThe Center for Advanced Scientific Instrumentation (CASI) houses state-of-the-art instrumentation to aid in the observation and analysis of a variety of specimens.\n[CASI Information](https://www.uwyo.edu/science-initiative/casi/index.html)\n### PGPF\nThe Plant Growth & Phenotyping Facility is an innovative center consisting of research greenhouses, walk-in chambers and laboratory spaces designated for research purposes. \n[Plant Facility](https://www.uwyo.edu/science-initiative/plant-facility/index.html)\n### ARCC\nThe Advanced Research Computing Center (ARCC) is the university’s main facility for data storage and high-performance computing capabilities for UW faculty and students. \n[UW Computing Center](https://www.uwyo.edu/arcc/index.html)\n### NCAR-Wyoming\nThe National Center for Atmospheric Research (NCAR) Wyoming Research Supercomputing Center is a high-performance computing center and data archival center in Cheyenne.\n[Supercomputing Center](https://www.uwyo.edu/nwsc/index.html)\n### CASI\nThe Center for Advanced Scientific Instrumentation (CASI) houses state-of-the-art instrumentation to aid in the observation and analysis of a variety of specimens.\n[CASI Information](https://www.uwyo.edu/science-initiative/casi/index.html)\n### PGPF\nThe Plant Growth & Phenotyping Facility is an innovative center consisting of research greenhouses, walk-in chambers and laboratory spaces designated for research purposes. \n[Plant Facility](https://www.uwyo.edu/science-initiative/plant-facility/index.html)\n### ARCC\nThe Advanced Research Computing Center (ARCC) is the university’s main facility for data storage and high-performance computing capabilities for UW faculty and students. \n[UW Computing Center](https://www.uwyo.edu/arcc/index.html)\n### NCAR-Wyoming\nThe National Center for Atmospheric Research (NCAR) Wyoming Research Supercomputing Center is a high-performance computing center and data archival center in Cheyenne.\n[Supercomputing Center](https://www.uwyo.edu/nwsc/index.html)\n### CASI\nThe Center for Advanced Scientific Instrumentation (CASI) houses state-of-the-art instrumentation to aid in the observation and analysis of a variety of specimens.\n[CASI Information](https://www.uwyo.edu/science-initiative/casi/index.html)\n### PGPF\nThe Plant Growth & Phenotyping Facility is an innovative center consisting of research greenhouses, walk-in chambers and laboratory spaces designated for research purposes. \n[Plant Facility](https://www.uwyo.edu/science-initiative/plant-facility/index.html)\nNext\n### UW Named Top 5% Research University\nThe Research and Economic Development Division at UW proudly drives innovation, research and service, enriching student experiences and fueling statewide economic growth. Now a Carnegie R1 institution, UW ranks among the nation’s top research universities.   \n  \n\n“R1 status boosts the value of a UW degree, strengthens recruitment, supports Wyoming’s economy and deepens student engagement,” says President Ed Seidel.  \n  \n\nWith $166M in annual research funding, UW faculty lead advances in energy, AI, agriculture, biomedicine and beyond. UW students and faculty are making an impact!\n[UW’s R1 Status](https://www.uwyo.edu/research/about/uwyo-r1-info.html)\n## Federal Funding Updates\nStay informed about federal funding opportunities and any policy changes by visiting our [Federal Funding Updates](https://www.uwyo.edu/research/support-and-resources/federal-funding-updates.html) page. This resource provides timely information on federal directives, including guidance on research compliance, proposal submissions and award management. You can also find updates on agency-specific policies and archived communications to help navigate the evolving funding landscape.\n* * *\nMore Redd Resources \n[REDD News & Announcements](https://www.uwyo.edu/research/announcements/news/index.html)\nKeep informed on the latest UW research developments, breakthroughs and the impacts they’re making across Wyoming and beyond.\n[Upcoming Trainings](https://www.uwyo.edu/research/announcements/training-calendars.html)\nExplore the REDD training and workshop calendar to stay informed about upcoming events, learning opportunities and research support sessions at UW.\n[REDD Newsletters](https://www.uwyo.edu/research/announcements/vp-newsletter/index.html)\nStay up to date with periodic news from the Research and Development Division at UW.\n[Annual Report](https://www.uwyo.edu/research/_files/_docs/redd-annual-report-fy2024-010625.pdf)\nLook over REDD’s annual report to gain insights into key research achievements, partnerships, funding highlights and the division’s impact across UW and Wyoming.\n## Contact Us\n### Research and Economic Development Division\nOld Main\n  * Room 308\n  * 1000 E. University Ave\n  * Laramie, WY 82071\n  * Dept. 3355\n  * Email: vpred@uwyo.edu\n  * Phone: [(307) 766-5353](tel:307-766-5353)\n\n\nThe University of Wyoming has earned its Research Level 1 (R1) status from the Carnegie Classification of Institutions of Higher Education, placing Wyoming's only four-year university with the [top research universities](https://www.uwyo.edu/research/index.html) in the United States.\n",
        "url_9": "# Cost of Attendance\nThe University of Wyoming (UW) consistently ranks among the best values in the country with low and cost-effective tuition for both resident and non-resident students. Cost of Attendance (COA is not a bill but is an estimate of school-related expenses a full-time student can expect to have for an academic year, and it can help a student estimate their overall out-of-pocket costs when attending UW.\nNavigation [ Main Page ](https://www.uwyo.edu/sfa)\nCost Of Attendance\n[LEARN MORE](https://www.uwyo.edu/sfa/cost-of-attendance/index.html)[Cost Of Attendance](https://www.uwyo.edu/sfa/cost-of-attendance/index.html)[COA - Graduate](https://www.uwyo.edu/sfa/cost-of-attendance/graduate.html)[COA - Online](https://www.uwyo.edu/sfa/cost-of-attendance/online.html)[COA - Undergraduate](https://www.uwyo.edu/sfa/cost-of-attendance/undergraduate.html)[Contact Us](https://www.uwyo.edu/sfa/contact-us.html)[Applying For Financial Aid](https://www.uwyo.edu/sfa/applying-for-financial-aid/index.html)[FAQs](https://www.uwyo.edu/sfa/faqs.html)[Private Loans](https://www.uwyo.edu/sfa/private-loans.html)[Renew Your Financial Aid](https://www.uwyo.edu/sfa/renew-your-financial-aid/index.html)[Scholarships](https://www.uwyo.edu/sfa/scholarships/index.html)[Sources of Federal Aid](https://www.uwyo.edu/sfa/sources-of-federal-aid.html)[Terms and Conditions](https://www.uwyo.edu/sfa/terms-and-conditions.html)\n[COA - Graduate](https://www.uwyo.edu/sfa/cost-of-attendance/graduate.html)\n[COA - Online](https://www.uwyo.edu/sfa/cost-of-attendance/online.html)\n[COA - Undergraduate](https://www.uwyo.edu/sfa/cost-of-attendance/undergraduate.html)\n[Contact Us](https://www.uwyo.edu/sfa/contact-us.html)\nApplying For Financial Aid\n[LEARN MORE](https://www.uwyo.edu/sfa/applying-for-financial-aid/index.html)[Financial Aid Appeals](https://www.uwyo.edu/sfa/applying-for-financial-aid/financial-aid-appeals/index.html)[Study Abroad](https://www.uwyo.edu/sfa/applying-for-financial-aid/study-abroad.html)[Summer Awards](https://www.uwyo.edu/sfa/applying-for-financial-aid/summer-awards.html)[Terms and Conditions](https://www.uwyo.edu/sfa/terms-and-conditions.html)[Verification](https://www.uwyo.edu/sfa/applying-for-financial-aid/verification/index.html)[Applying For Financial Aid](https://www.uwyo.edu/sfa/applying-for-financial-aid/index.html)[Consortium Agreement](https://www.uwyo.edu/sfa/applying-for-financial-aid/consortium-agreement.html)\n[FAQs](https://www.uwyo.edu/sfa/faqs.html)\n[Private Loans](https://www.uwyo.edu/sfa/private-loans.html)\nRenew Your Financial Aid\n[LEARN MORE](https://www.uwyo.edu/sfa/renew-your-financial-aid/index.html)[Satisfactory Academic Progress](https://www.uwyo.edu/sfa/renew-your-financial-aid/sap/index.html)[Renew Your Financial Aid](https://www.uwyo.edu/sfa/renew-your-financial-aid/index.html)[ Financial Aid Appeals](https://www.uwyo.edu/sfa/applying-for-financial-aid/financial-aid-appeals/index.html)\nScholarships\n[LEARN MORE](https://www.uwyo.edu/sfa/scholarships/index.html)[Resident Students - Undergraduate](https://www.uwyo.edu/sfa/scholarships/residents/index.html)[Non-Resident Students - Undergraduate](https://www.uwyo.edu/sfa/scholarships/non-residents/index.html)[International Students - Undergraduate](https://www.uwyo.edu/sfa/scholarships/international/index.html)[Transfer Students - Undergraduate](https://www.uwyo.edu/sfa/scholarships/transfers/index.html)[Non-Traditional Students - Undergraduate](https://www.uwyo.edu/sfa/scholarships/wyomings-tomorrow-scholarship.html)[External Scholarships](https://www.uwyo.edu/sfa/scholarships/external-scholarships.html)\n[Sources of Federal Aid](https://www.uwyo.edu/sfa/sources-of-federal-aid.html)\n[Terms and Conditions](https://www.uwyo.edu/sfa/terms-and-conditions.html)\n## COA includes direct expenses (billed by the university) and indirect expenses, and it considers a student's residency status, living arrangements and, in some cases, the student's major. The following components are included in in COA as required by federal law and will be used to determine financial aid.\nDirect Expenses\n  * Tuition\n  * Fees\n  * Living Expenses (Housing and Food) if on-campus\n\n\nIndirect Expenses\n  * Books, Course Materials, Supplies, and Equipment\n  * Transportation\n  * Miscellaneous Personal Expenses\n  * Living Expenses (Housing and Food) if off-campus or at home\n\n\n## Select your degree below to review Cost of Attendance\n[Undergraduate Degrees](https://www.uwyo.edu/sfa/cost-of-attendance/undergraduate.html)\n[Graduate Degrees](https://www.uwyo.edu/sfa/cost-of-attendance/graduate.html)\n[Online Degrees](https://www.uwyo.edu/sfa/cost-of-attendance/online.html)\n## Contact Us\n### Office of Scholarships & Financial Aid\nKnight Hall\n  * Room 174\n  * 1000 E. University Ave\n  * Dept. 3335\n  * Laramie, WY 82071\n  * Email: finaid@uwyo.edu\n  * Phone: [(307) 766-2116](tel:307-766-2116)\n  * [Schedule a Meeting](https://outlook.office.com/book/UWScholarshipsFinancialAid@uwy.onmicrosoft.com/?ismsaljsauthenabled)\n\n\nThe University of Wyoming has earned its Research Level 1 (R1) status from the Carnegie Classification of Institutions of Higher Education, placing Wyoming's only four-year university with the [top research universities](https://www.uwyo.edu/research/index.html) in the United States.\n",
        "url_10": "About the Department of Electrical Engineering and Computer Science (EECS)\n# About the Department of Electrical Engineering and Computer Science (EECS)\nA message from Dr. Ian Walker, Department Head:\nWelcome to the Electrical Engineering and Computer Science (EECS) department at the University of Wyoming! The department aims to provide a first-class education for our students, as well as cutting-edge research to benefit Wyoming and the World. Our EECS community - faculty, staff, students, alumni, and friends - supports a wide range of activities, interests, and experiences, and we encourage you to learn more about us!\nNavigation [ Main Page ](https://www.uwyo.edu/eecs)\nAbout the Department\n[LEARN MORE](https://www.uwyo.edu/eecs/about/index.html)[About the Department](https://www.uwyo.edu/eecs/about/index.html)[Lab Facilities](https://www.uwyo.edu/eecs/_files/doc/eecs-laboratories.pdf)[CEPS Advising](https://www.uwyo.edu/ceps/academics/advising/index.html)\n[Lab Facilities](https://www.uwyo.edu/eecs/_files/doc/eecs-laboratories.pdf)\nCEPS Advising\n[LEARN MORE](https://www.uwyo.edu/ceps/academics/advising/index.html)[Advising Services](https://www.uwyo.edu/ceps/academics/advising/adserv.html)[Curriculum Information](https://www.uwyo.edu/ceps/academics/advising/curriculum.html)[Policies and Procedures ](https://www.uwyo.edu/ceps/academics/advising/policies-and-procedures.html)[Resources for Success](https://www.uwyo.edu/ceps/academics/advising/resources.html)[Student Expectations](https://www.uwyo.edu/ceps/academics/advising/student.html)[Advising Center Staff](https://www.uwyo.edu/ceps/academics/advising/staff/index.html)\n## Information\n### Lab Facilities\nThe University of Wyoming's Electrical Engineering and Computer Science (EECS) department is distinguished by its **exceptional, lab-intensive program** , which provides students with critical hands-on experience using continuously updated, state-of-the-art facilities. A collaborative environment, supported by dedicated staff and graduate teaching assistants, ensures seamless access to equipment and proper operation. Students benefit from diverse lab resources and are encouraged to engage in faculty-led research, further enhancing their practical skills.\n[Learn More](https://www.uwyo.edu/eecs/_files/doc/eecs-laboratories.pdf)\n### EECS Research\nEECS research pushes the boundaries of innovation across diverse fields, from fundamental computer science and electrical engineering principles to cutting-edge applications. Our faculty and students engage in impactful projects spanning areas like artificial intelligence, cybersecurity, sustainable energy, robotics, and advanced materials. This vibrant research environment fosters breakthroughs that address global challenges and shape the future of technology.\n[Learn more](https://www.uwyo.edu/eecs/research/index.html \"Learn more\")\n### Careers in EECS\nGraduates with an EECS background are highly sought after across virtually every industry, from tech giants to healthcare, finance, and beyond. They are equipped for impactful roles, including software engineers, data scientists, hardware designers, cybersecurity analysts, and research scientists. An EECS degree opens doors to innovative careers that shape the future and drive technological advancement globally.\n[Learn More](https://www.uwyo.edu/ceps/resources/studentservices/jobs/index.html \"Learn More\")\n### Why the Electrical Engineering and Computer Science Department at UW?\nThere are[many reasons](https://www.uwyo.edu/ceps/resources/studentservices/why-uw.html)\nThe EECS Department at UW is large enough to cover most any interest area you might have, but small enough to let us get to know our students on a personal basis. As you can see from the web site, we offer electrical engineering, computer engineering, and computer science degrees. If you’re interested, we also have frequent opportunities for undergraduates to participate in various research projects. EECS faculty members have traditionally maintained a flexible open-door policy, making them extremely accessible to students. The qualifications of the EECS faculty members are excellent, with many in leadership positions in national and international organizations, several are textbook authors, and all are active in their respective specialties. The department has many well-equipped laboratories, offers free access to computer systems running any software you need for your studies, maintains small class sizes, and provides a friendly, supportive environment for students. Talk to any former or current EECS students, and you’ll see what we mean—the EECS Department at UW is a special place.\n## About our disciplines\nAbout Electrical and Computer Engineering:\nVirtually every aspect of modern life involes electrical or computer technology. Electrical and Computer engineering has become a core element of our society, providing innovation and jobs across a huge range of industries. Recently secured external grants provide both graduate and undergraduate EECS Students the opportunity to take part in rapidly growing technology fields such as AI/Machine Learning, power, robotics, and High Performance Computing. \n[Learn more about our Undergraduate programs](https://www.uwyo.edu/eecs/undergraduate/index.html \"Undergraduate\")\n[Learn more about our Graduate program](https://www.uwyo.edu/eecs/graduate/index.html \"Graduate\")\nAbout Computer Science:\nThere are more software jobs than can be filled with current graduates, with this remaining true for the foreseeable future. These are high-paying jobs housed in rich working environments. Software-related work is a highly creative endeavor and interesting design problems arise in every project. The creative aspect of the work is stimulating and can sustain an entire career. Traditional areas of computer science such as graphics, software engineering, networks, databases, multimedia, and artificial intelligence remain strong, with job growth being driven by advances in robotics and the fundamental impact of computer science in nearly every industry. There are many challenging problems remaining for computer scientists to solve.\n[LEARN MORE ABOUT OUR QuickStart PROGRAM](https://www.uwyo.edu/uw/degree-programs/computer-electrical-engineering-quickstart.html \"QuickStart\")\n## Info Carousel Slider\nAverage Annual Salaries\nThe Average Entry Level Salary for Electrical Engineers, Computer Engineers, and Computer Science graduate are $73,000, $77,000, and $78,000 respectively.\nCutting-Edge Active Research Areas\nRobotics, computer vision, power, signal processing, & controls artificial intelligence, machine learning, high performance computing, cybersecurity, human centered computing, & augmented/virtual reality.\n[Learn more](https://www.uwyo.edu/eecs/research/index.html)\nJob opportunities for students\n[Career Services](https://www.uwyo.edu/aces/career-services/index.html \"Career Services\")\n[Handshake](https://www.uwyo.edu/aces/career-services/handshake.html)\n[Jobs for Students](https://www.uwyo.edu/ceps/resources/studentservices/jobs/index.html)\n### Careers in Electrical Engineering and Computer Science (EECS)\nThe faculty of the Department of Electrical Engineering and Computer Science endeavor to train the next generation of top-quality engineers, researchers, and scientests. With a combination of successful, funded research and top-level industrial experience, EECS professors bridge the gap between theory and practice, creating an environment in which students can develop the requisite skills demanded by the best employers.\n[More about Career Services](https://www.uwyo.edu/eecs/about/index.html#career-services \"More about Career Services\")\nCUTTING-EDGE ACTIVE RESEARCH AREAS\nRobotics, computer vision, power, signal processing, & controls artificial intelligence, machine learning, high performance computing, cybersecurity, human centered computing, & augmented/virtual reality.\n[EECS Research](https://www.uwyo.edu/eecs/research/index.html \"EECS Research\")\n## Average Annual Salaries\n$73000\nAverage Entry Level Salary for Electrical Engineers\n$77000\nAverage Entry Level Salary for Computer Engineers\n$78000\nAverage Entry Level Salary for Computer Science Graduates\nCareer Services\n[Campus Career Services](https://www.uwyo.edu/aces/career-services/index.html \"Career Services\")\nTo learn more about student job opportunities visit the Career Services page \n[CEPS Career Services](https://www.uwyo.edu/ceps/resources/studentservices/jobs/students.html \"CEPS Career Services \")\nTo learn more about industry specific job opportunites visit the CEPS Career Services page or visit their office in EN 2079.\n[Handshake](https://www.uwyo.edu/aces/career-services/handshake.html \"Handshake\")\nHandshake is recruiting platform that connects student to employers.\n[Advising Career Exploratory Studies Center](https://www.uwyo.edu/aces/index.html \"ACES\")\nACES provides career counceling, career services, and academic advising.\nAbout Laramie, Wyoming\nTo learn more about the wonderful things you can see and do here in Laramie, click the button below!\n[Learn More](https://www.visitlaramie.org/)\n## Contact Us\n### Department of Electrical Engineering and Computer Science\nEngineering Building\n  * Room 5068\n  * 1000 E. University Ave\n  * Laramie, WY 82071\n  * Dept. 3315\n  * Email: eecs@uwyo.edu\n  * Phone: [(307) 766-2279](tel:307-766-2279)\n\n\nThe University of Wyoming has earned its Research Level 1 (R1) status from the Carnegie Classification of Institutions of Higher Education, placing Wyoming's only four-year university with the [top research universities](https://www.uwyo.edu/research/index.html) in the United States.\n",
        "url_11": "Apply to the University of Wyoming\n## We value your privacy\nThe University of Wyoming uses cookies to enhance your browsing experience, serve personalized ads or content, and analyze our traffic. By clicking \"Accept All\", you consent to our use of cookies. You may withdraw your consent at any time by clicking the small icon at the bottom left corner of the website. [UW Privacy & Cookie Policy](https://www.uwyo.edu/uw/disclaimer.html)\nAccept all Decline all powered by: [Cookie Information](https://cookieinformation.com/)\n* Functional\n* Statistical\n* Marketing\n# Apply to the University of Wyoming!\nThe University of Wyoming invites you to discover a unique educational experience in the heart of the Mountain West. With over 200 areas of study, UW offers personalized learning, meaningful faculty connections and a supportive community where students thrive. Applying to UW is the first step towards your future!\n[ Apply Online ](https://uwyo-erx.my.site.com/ERx_Forms__Portal_Register)\n[Explore UW Majors](https://www.uwyo.edu/uw/degree-programs/index.html)\nUW offers over 200 areas of study for students to pursue their passion!\nNavigation [ Main Page ](https://www.uwyo.edu/admissions)\n[Apply](https://www.uwyo.edu/admissions/apply.html)\n[Contact Us](https://www.uwyo.edu/admissions/contact.html)\nRequest Info\n[LEARN MORE](https://www.uwyo.edu/admissions/request-information/index.html)[Undergraduate Students](https://uwyo-erx.my.salesforce-sites.com/leads/apex/ERx_Forms__PageMaker?pageId=Undergraduate&UW=UG)[Graduate Students](https://uwyo-erx.my.salesforce-sites.com/leads/apex/ERx_Forms__PageMaker?pageId=Graduate&UW=Grad)[International Students](https://uwyo-erx.my.salesforce-sites.com/leads/apex/ERx_Forms__PageMaker?pageId=Undergraduate&UW=INTL)[Online Students](https://uwyo-erx.my.salesforce-sites.com/leads/apex/ERx_Forms__PageMaker?pageId=UWOnline&amp;uw=online)[Non-Degree Students](https://uwyo-erx.my.salesforce-sites.com/leads/apex/ERx_Forms__PageMaker?pageId=Undergraduate&UW=UG)\nVisit & Tour Campus\n[LEARN MORE](https://www.uwyo.edu/admissions/visit/index.html)[Weekday Visits](https://www.uwyo.edu/admissions/visit/weekday-visits/index.html)[Admissions Events](https://www.uwyo.edu/admissions/visit/events/index.html)[Take a Virtual Tour](https://www.uwyo.edu/uw/virtualtour.html)[Plan Your Visit to Laramie](https://www.uwyo.edu/admissions/visit/plan-your-visit.html)[K-12 Camps](https://www.uwyo.edu/admissions/visit/camps.html)\nFirst-Year Students\n[LEARN MORE](https://www.uwyo.edu/admissions/freshman/index.html)[Next Steps to Enroll](https://www.uwyo.edu/admissions/freshman/nextsteps.html)[Admission With Support](https://www.uwyo.edu/admissions/freshman/admission-with-support.html)[Start at a WY Community College](https://www.uwyo.edu/admissions/transfer/start-at-wy-cc.html)[Defer your Enrollment](https://www.uwyo.edu/admissions/defer-enrollment.html)\nTransfer Students\n[LEARN MORE](https://www.uwyo.edu/admissions/transfer/index.html)[Transferring Credits](https://www.uwyo.edu/admissions/transfer/transferring-credits.html)[Next Steps to Enroll](https://www.uwyo.edu/admissions/transfer/next-steps.html)[Express Transfer Agreement](https://www.uwyo.edu/admissions/transfer/transfer-agreement.html)[Start at a WY Community College](https://www.uwyo.edu/admissions/transfer/start-at-wy-cc.html)\nInternational Students\n[LEARN MORE](https://www.uwyo.edu/admissions/international/index.html)[First-Year International Admissions](https://www.uwyo.edu/admissions/international/requirements-first-year.html)[Graduate International Admissions](https://www.uwyo.edu/admissions/international/requirements-graduate.html)[Transfer International Admissions](https://www.uwyo.edu/admissions/international/requirements-transfer.html)[English Proficiency](https://www.uwyo.edu/admissions/international/english-alternatives.html)\n[Graduate Students](https://www.uwyo.edu/admissions/graduate.html)\nAdditional Student Categories\n[LEARN MORE](https://www.uwyo.edu/admissions/additional-student-categories/index.html)[High School Guests](https://www.uwyo.edu/admissions/additional-student-categories/high-school-guests.html)[Returning Students](https://www.uwyo.edu/admissions/additional-student-categories/returning.html)[Military & Veteran Students](https://www.uwyo.edu/admissions/additional-student-categories/veterans.html)[Second Bachelor Degrees](https://www.uwyo.edu/admissions/additional-student-categories/second-bachelors.html)[Non-Degree Seeking Students](https://www.uwyo.edu/admissions/additional-student-categories/non-degree/index.html)\n[Next Steps for Admitted Students](https://www.uwyo.edu/admissions/nextsteps.html)\n[New Student Onboarding](https://www.uwyo.edu/admissions/onboarding.html)\nHear From UW Students\n[LEARN MORE](https://www.uwyo.edu/blog/index.html)[Student Life Blogs](https://www.uwyo.edu/blog/student-life/index.html)[Academics & Career Blogs](https://www.uwyo.edu/blog/academics-and-career/index.html)[Outreach & Community Blogs](https://www.uwyo.edu/blog/outreach-and-community/index.html)[Becoming a Student Blogs](https://www.uwyo.edu/blog/becoming-a-student/index.html)\nAdmissions Representatives\n[LEARN MORE](https://www.uwyo.edu/admissions/counselors/index.html)[Adrienne Loveland](https://www.uwyo.edu/admissions/counselors/adrienne-loveland.html)[Alyssa Reeve](https://www.uwyo.edu/admissions/counselors/alyssa-reeve.html)[Amy Schmidt](https://www.uwyo.edu/admissions/counselors/amy-schmidt.html)[Daiton Lemmon](https://www.uwyo.edu/admissions/counselors/daiton-lemmon.html)[Gracie Gibbons](https://www.uwyo.edu/admissions/counselors/gracie-gibbons.html)[Joey Schaff](https://www.uwyo.edu/admissions/counselors/joey-schaff.html)[Kate Kastl](https://www.uwyo.edu/admissions/counselors/kate-kastl.html)[Kirby Federocko](https://www.uwyo.edu/admissions/counselors/kirby-federocko.html)[Lisa Harsh](https://www.uwyo.edu/admissions/counselors/lisa-harsh.html)[Mackenzie Tilton](https://www.uwyo.edu/admissions/counselors/mackenzie-tilton.html)[Margaret McElligott](https://www.uwyo.edu/admissions/counselors/margaret-mcelligott.html)[Sara Mena-Vargas](https://www.uwyo.edu/admissions/counselors/sara-mena-vargas.html)\nFamily Guide to UW\n[LEARN MORE](https://www.uwyo.edu/admissions/family-resources/index.html)[FAQs](https://www.uwyo.edu/admissions/family-resources/faqs.html)\n## UW Admissions Requirements\n###  First-Year Students \nUW welcomes all first-time students to apply and considers each applicant based on academic achievement and completion of the High School Success Curriculum. Students with a cumulative, unweighted high school GPA of 3.00–4.00 (on a 4.0 scale) are assured admission, while those with a GPA of 2.50–2.99 are [admitted with support](https://www.uwyo.edu/admissions/freshman/admission-with-support.html).  \n  \n\n**High School Success Curriculum:**\n  * 4 years English\n  * 4 years Math\n  * 4 years Science\n  * 3 years Social Sciences\n  * 4 years additional coursework\n\n\n[Learn More](https://www.uwyo.edu/admissions/freshman/index.html)\n[International First Year Student?](https://www.uwyo.edu/admissions/international/requirements-first-year.html)\nLearn more about the international first-year student admissions process. \n###  Transfer Students \nTransfer students thrive at the University of Wyoming! Transfer students who have obtained at least 12 post-high school transfer credits are eligible for UW's [transfer commitments](https://www.uwyo.edu/sfa/scholarships/transfers/index.html)!  \n  \n\n**Transfer Students Admissions Requirements:**\n  * Cumulative 2.0 GPA (on an unweighted 4.0 scale)\n  * 12 transferable credit hours\n  * *If less than 12 transferable credit hours, a high school transcript is required and ACT or SAT score is required if the student is less than 21 years of age.\n\n\n[Learn More](https://www.uwyo.edu/admissions/transfer/index.html)\n[International Transfer Student?](https://www.uwyo.edu/admissions/international/requirements-transfer.html)\nLearn more about the international transfer student admissions process. \n###  Graduate Students \nProspective graduate students are encouraged to consult with their respective[academic departments](https://www.uwyo.edu/uw/degree-programs/index.html)regarding the admission process before making a formal UW application as graduate requirements can differ by program.\n[Learn More](https://www.uwyo.edu/admissions/graduate.html)\n[International Graduate Student?](https://www.uwyo.edu/admissions/international/requirements-graduate.html)\nLearn more about the international graduate student admissions process. \n## UW Admissions FAQs\nWe want applying to UW to be simple and stress-free. This is an exciting step and it doesn’t have to be complicated! Below are some frequently asked questions to help guide you as you begin your UW admissions process.\nWhat materials should I have to apply? \nThe most important item to have on hand is your official high school transcripts. [Transcripts will be sent to UW with your application](https://www.uwyo.edu/admissions/freshman/index.html#steps). Beyond that, you’ll want any ACT or SAT scores and documentation of any previous college credits, if applicable.\nIs an ACT or SAT score required? \nCurrently, an ACT or SAT score is not part of the admissions requirements for the University of Wyoming. However, these scores can help you to earn more [financial assistance](https://www.uwyo.edu/sfa/scholarships/index.html).\nDoes applying to UW cost money? \nYes, there is a non-refundable $40 application fee that is processed when you submit your application.\nWho can I contact for further help? \nUs! Contacting the friendly and helpful UW admissions team is quite simple. You can quickly chat with us via [UW Answers](https://www.uwyo.edu/admissions/contact.html#answers). You can also call us at (307) 766-5160 or email us at admissions@uwyo.edu.\n### Applying takes less than 10 minutes!\nApplying to the University of Wyoming is easy and straightforward. Our simple, user-friendly online application, ensures the process only takes a few steps and just about 10 minutes. Of course, if you do run into any questions [UW Admissions](https://www.uwyo.edu/admissions/contact.html) is here to help you every step of the way. Whether you're a first-year, transfer or returning student, UW makes it easy to take the first step toward your future. Apply today and get started!\n[Start Your Application!](https://uwyo-erx.my.site.com/ERx_Forms__Portal_Register)\n## Additional Student Categories\nSelect Your Student Type\nSecond Bachelor’s Degree Students  Veteran Students  Returning Students  Non-Degree Seeking Students  UW Casper Students  Online Students  High School Guest Students \nSecond Bachelor’s Degree Students \nIf you have already received a bachelor’s degree from the University of Wyoming and are interested in pursuing a second, your path to UW admissions looks a bit different. Our goal is to streamline this process, so you can quickly return to your academic goals. Our admissions team is here to help each step of the way.\n[Second Bachelor’s Degree Students](https://www.uwyo.edu/admissions/additional-student-categories/second-bachelors.html)\nUW is proud to welcome and support our military and veteran students! Our admissions team is here to help you navigate the application process and connect with the resources you need. There are several student groups and programs on campus to help military and veteran students succeed both academically and personally!\n[Veteran Students](https://www.uwyo.edu/admissions/additional-student-categories/veterans.html)\nWelcome back to UW! Whether you have taken a quick academic break, or have stepped away for a longer period of time, we are here to help ensure a smooth re-enrollment to the University of Wyoming. There are different steps that need to be taken depending on your specific circumstances, and our team is here to provide all the assistance you need.\n[Returning Students](https://www.uwyo.edu/admissions/additional-student-categories/returning.html)\nThe University of Wyoming offers a non-degree admission status for students who wish to take courses without pursuing a degree. This flexible option allows you to explore interests and learn more about your passions. Applying for this path looks a little different, but is still straightforward and you have access to our admissions team for any guidance you may need.\n[Non-Degree Seeking Students](https://www.uwyo.edu/admissions/additional-student-categories/non-degree/index.html)\nThe University of Wyoming Casper is a unique partnership between UW and Casper College. Students from UW Casper that wish to attend the University of Wyoming in Laramie can work with admissions teams at both locations to help ensure a seamless transition.\n[Students from UW Casper](https://www.uwyo.edu/uwcasper/index.html)\nUW Online Education brings the University of Wyoming’s academic programs to learners across Wyoming and beyond through innovative distance learning. We offer flexible learning opportunities to allow for more students of all backgrounds and locations to access UW world-class education! Applying to be an online UW student is quick and easy.\n[Online Students](https://www.uwyo.edu/online/index.html)\nUW offers the unique opportunity for current juniors and seniors to take classes and earn credits while still in high school. Eligible students can apply to UW as dual-enrollment students and get a jumpstart on pursuing their academic goals!\n[High School Guest Students](https://www.uwyo.edu/admissions/additional-student-categories/high-school-guests.html)\nSecond Bachelor’s Degree Students \n### Select Your Student Type\nSecond Bachelor’s Degree Students  Veteran Students  Returning Students  Non-Degree Seeking Students  UW Casper Students  Online Students  High School Guest Students \n## Apply to UW in 3 Steps\n### Step 1\nFill out UW’s online application or the Common Application to get the admissions process started. The application can be completed in just a few minutes.\n[Online Application](https://uwyo-erx.my.site.com/ERx_Forms__Portal_Register)\n### Step 2\nSubmit additional materials to UW Admissions, including official high school transcripts. You may also submit standardized test scores, AP scores, or CLEP scores, if applicable.\n[Submit Your Materials](https://www.uwyo.edu/registrar/undergraduate-students/credit.html)\n### Step 3\nOnce you have applied and submitted all your necessary materials, you can check the status of your UW application.\n[Check Application Status](https://uwyo-erx.my.site.com/ERx_Forms__Portal_Login)\n### Scholarships and Financial Aid Available\nThe University of Wyoming is committed to enhancing the lives of our students and strengthening our communities by making higher education accessible. This commitment begins with an easy and straightforward application process, ensuring that all students can take the first step toward their academic journey without unnecessary barriers. Beyond admissions, UW provides unparalleled access to a wide range of scholarships and financial aid opportunities, designed to support students from all backgrounds. Whether you’re pursuing an undergraduate degree or advanced studies, we are dedicated to helping you achieve your educational goals with financial support and guidance every step of the way.\n[Explore Scholarships](https://www.uwyo.edu/sfa/scholarships/index.html)\n## Cost of Attendance\nThe University of Wyoming is proud to consistently rank as one of the most cost-effective universities in the nation. for both resident and non-resident students. With competitive tuition rates and generous financial aid opportunities, UW offers affordable, high-quality education. You can easily estimate your [cost of attendance](https://www.uwyo.edu/sfa/cost-of-attendance/index.html) using our online tools, helping you plan and prepare for your college journey.\n[Tour UW](https://www.uwyo.edu/admissions/visit/index.html)\nVisiting and taking a tour of our campus is a great way to get a taste of the UW experience! Can’t visit in-person? You can take a [virtual tour](https://www.youvisit.com/tour/uwyo/139452?pl=v&m_prompt=1) from wherever you are.\n[Scholarship Opportunities](https://www.uwyo.edu/sfa/scholarships/index.html)\nUW offers financial aid and scholarship opportunities in order to make higher education more accessible. Be sure to take a close look at the opportunities that are available to you!\n[Check Application Status](https://uwyo-erx.my.site.com/ERx_Forms__Portal_Login)\nUse our easy login portal to complete your application or check the status of an application that has already been submitted.\n[Find an Admissions Rep](https://www.uwyo.edu/admissions/counselors/index.html)\nUW admissions representatives can help guide you through the application, share insights on life at UW and answer all your questions one-on-one.\nGet in Touch with UW Admissions\nApplying is a big step, but you’re not alone. Our knowledgeable UW staff is here to answer any questions you may have!\n[Contact us!](https://www.uwyo.edu/admissions/contact.html)\n## Next Steps\n[Explore Over 200 Majors](https://www.uwyo.edu/uw/degree-programs/index.html)\nTake some time to look over all the areas of education you can dive into at the University of Wyoming.\n[Check Out Campus Life](https://www.uwyo.edu/fye/campus-life.html)\nThere’s always something happening on campus at UW! Take a look at upcoming events.\n[UW Dining & Housing](https://www.uwyo.edu/living/index.html)\nExplore UW’s on-campus dining and residence halls to see what’s the best fit for you!\n## Contact Us\n### UW Office of Admissions\nKnight Hall\n  * Room 150\n  * 1000 E. University Ave\n  * Laramie, WY 82071\n  * Dept. 3435\n  * Toll Free: (800) 342-5996\n  * Email: admissions@uwyo.edu\n  * Phone: [(307) 766-5160](tel:307-766-5160)\n  * [UW Student Blog](https://www.uwyo.edu/blog/index.html)\n\n\nThe University of Wyoming has earned its Research Level 1 (R1) status from the Carnegie Classification of Institutions of Higher Education, placing Wyoming's only four-year university with the [top research universities](https://www.uwyo.edu/research/index.html) in the United States.\n",
        "url_12": "## We value your privacy\nThe University of Wyoming uses cookies to enhance your browsing experience, serve personalized ads or content, and analyze our traffic. By clicking \"Accept All\", you consent to our use of cookies. You may withdraw your consent at any time by clicking the small icon at the bottom left corner of the website. [UW Privacy & Cookie Policy](https://www.uwyo.edu/uw/disclaimer.html)\nAccept all Decline all powered by: [Cookie Information](https://cookieinformation.com/)\n* Functional\n* Statistical\n* Marketing\n# Computer Science\n## Master of Science (M.S.)\n## Doctor of Philosophy (Ph.D.)\n[Apply Now](https://www.uwyo.edu/admissions/apply.html)[Visit Campus](https://www.uwyo.edu/admissions/visit/index.html)\n## Earn Your Graduate Degree in Computer Science at UW\nComputer science graduate students from around the world are brought together at UW to learn in an exciting atmosphere. Students are encouraged to bring their curiosity and sense of discovery to each course and research project.\nAs a computer scientist at UW, you’ll gain a deep knowledge of the theory and practice of computing — an essential skill in today's modern world. Whether you’re pursuing a master’s degree in computer science or a Ph.D. in computer science, you’ll leave UW prepared to advance the computing industry’s principles and practices.\n[ Request Info ](https://www.uwyo.edu/admissions/request-information/index.html)\nThis program is currently offered in   \nthe following locations: \nLaramie Campus\n## About the Ph.D. and Master's Degree in Computer Science\n###  Program Overview \nUW’s computer science graduate programs give students the opportunity to learn from accomplished professors in small group settings. Our faculty conduct research in a wide variety of areas, including computational complexity, distributed computing, formal verification and theorem proving, artificial intelligence, computer vision, virtual reality and cybersecurity.  \n  \nOur goal as a department is to help students gain hands-on experience. That’s why all computer science students have access to state-of-the-art equipment, conferences and workshops. We additionally partner with companies and research institutions to provide students with internships. The majority of our graduate students receive stipends that cover tuition costs and living expenses.\n###  Admission Requirements \n**Applicants for a graduate degree in computer science are expected to have completed undergraduate courses in:**\n  * Algorithms and Data Structures (COSC 3020 equivalent)\n  * Theory of Computing (COSC 4100 or 4200 equivalent)\n  * Operating Systems (COSC 4740 equivalent)\n  * Programming Languages or Compilers (COSC 4780 or 4785 equivalent)\n\n\n  \n**Applicants to the Ph.D. in computer science must have completed a bachelor's degree in computer science or a closely related discipline at an accredited university or college.**  \n  \n**The Graduate Record Examination (GRE) is encouraged but not required.**\n  * GRE scores should be a minimum of 40th percentile for the verbal score and 65th percentile for the quantitative score. Our strongest students tend to have scores substantially above these minimums, with quantitative scores often around the 90th percentile or higher.  \n  \n\n\n\n**Students whose native language is not English must also complete the Test of English as a Foreign Language (TOEFL) with scores of at least:**\n  * 550 on the paper based TOEFL\n  * 213 on the computerized test, including a 58 or better in Reading Test 1\n  * 80 for the internet based TOEFL (iBT), including a score of 23 or better in Reading Test 1\n\n\n  \n**Alternatively, students may take the International English Language Testing System (IELTS) test. They must score 6.5 or better.**  \n  \n**Applicants must submit contact information for three references who can evaluate their potential for graduate study in computer science. If you wish to pursue a Ph.D. in computer science, the reference letters should address your ability to pursue quality original research. Letters should also evaluate your oral and written communication skills.**  \n  \n**If you meet the minimum criteria and would like to formally apply for admission you will also need to submit the following information during the completion of your application via the application portal:**\n  * Copies of your transcripts from all colleges and universities for all degrees attained. You must have a minimum GPA of 3.0 out of 4.0 or equivalent.  \n\n    * International applicants must submit copies of individual semester transcripts. Consolidated transcripts will not be accepted.  \nGRE scores \n  * Contact information for three recommendation letters  \n\n    * Applicants should follow up with recommenders to ensure this requirement is fulfilled. Applications will not be processed further until all recommendations have been received.\n  * International students will also need to submit a copy of TOEFL scores or IELTS scores.\n\n\n###  Courses & Curriculum \nOur master's program covers essential topics such as Analysis of Algorithms, AI, ML, Cybersecurity and HCI, equipping students with the skills needed for various professional pathways. For those aiming for higher academic pursuits, our Ph.D. program delves deeper into computing principles and practices, with specialized focuses including AI, Complexity & Information Theory, Human-Computer Interaction, Cybersecurity, Machine Learning, Computer Vision and Distributed Computing. Join us to embark on a journey of academic excellence and professional growth in the field of Computer Science.\n  * **View the full master of science in computer science[curriculum](https://acalogcatalog.uwyo.edu/preview_program.php?catoid=16&poid=17362&_gl=1*1jlyun0*_ga*MTA4ODMwNDE2MS4xNzM2NzkzMDYx*_ga_DCJG3HESYS*czE3NDczNDE0MDAkbzIyMiRnMSR0MTc0NzM0MjE5MSRqNTMkbDAkaDA.*_gcl_au*NDY3NTI3MzIxLjE3NDcxNTk2ODk. \"View the full master of science in computer science curriculum\").**\n  * **View the full Ph.D. in computer science[curriculum](https://acalogcatalog.uwyo.edu/preview_program.php?catoid=16&poid=17363&_gl=1*1jlyun0*_ga*MTA4ODMwNDE2MS4xNzM2NzkzMDYx*_ga_DCJG3HESYS*czE3NDczNDE0MDAkbzIyMiRnMSR0MTc0NzM0MjE5MSRqNTMkbDAkaDA.*_gcl_au*NDY3NTI3MzIxLjE3NDcxNTk2ODk. \"View the full Ph.D. in computer science curriculum\").**\n\n\n## Computer Science Graduate Minor\nEnhance your expertise with a graduate minor in computer science! This program equips you with the skills to understand and develop software-intensive systems, empowering you to use computing to drive innovation in your field.\n[Learn More](https://acalogcatalog.uwyo.edu/preview_program.php?catoid=16&poid=17364 \"Learn more about the computer science graduate minor\")\n## Computer Science Graduate Program Highlights\nSelect a Highlight\nCutting-Edge Research Facilities  Student Organizations  Internationally Recognized Faculty \nCutting-Edge Research Facilities \nOur computer science department runs several cutting-edge, interdisciplinary centers that students have access to for projects and coursework.\n  * Secure Sensing and Learning (SSL) Lab\n  * [Artificially Intelligent Manufacturing (AIM) Center](https://www.uwyo.edu/ceps/engineering-initiative/aim.html \"Learn more about the Artificially Intelligent Manufacturing \\(AIM\\) Center\")\n  * 3D Interaction and Agents (3DIA) Research Lab\n  * Meta-Algorithmics, Learning and Large-scale Empirical Testing (MALLET) Lab \n\n\nMany UW graduate and undergraduate students get involved in student-led organizations. These organizations are a great way to network with professionals and connect with like-minded students.\n  * Association for Computing Machinery\n  * Google Developer Student Club\n  * Phi Sigma Rho\n  * Society of Women Engineers\n  * Upsilon Pi Epsilon\n\n\n[Student Organizations](https://www.uwyo.edu/csil/student-orgs/index.html \"Learn more about student organizations\")\nUW’s computer science graduate programs are led by expert faculty engaged in cutting-edge research. Areas of focus include artificial intelligence, machine learning, computational complexity, human-computer interaction, cybersecurity and formal methods. Students benefit from close mentorship with faculty members and the opportunity to contribute to innovative, real-world solutions in a rapidly evolving field.\n[Meet Our Faculty](https://www.uwyo.edu/eecs/faculty-staff/index.html \"Learn more about our faculty\")\nCutting-Edge Research Facilities \n### Select a Highlight\nCutting-Edge Research Facilities  Student Organizations  Internationally Recognized Faculty \n## What Can You Do With a Computer Science Graduate Degree?\nWith a computer science graduate degree from the University of Wyoming, you can pursue advanced roles in software development, AI, data science, cybersecurity, robotics and research. Graduates work in a wide variety of private and public fields, solving complex problems and driving innovation for the future.\nWhat jobs and careers are available for computer science graduates? \n  * Data Scientist\n  * Machine Learning Expert\n  * Computer Science Professor\n  * Software Engineer\n  * Senior Site Reliability Engineer\n  * AI Researcher\n  * Cybersecurity Analyst or Architect\n  * Robotics Engineer\n  * Research Scientist\n  * Cloud Solutions Architect\n  * Natural Language Processing Specialist\n  * Computer Vision Engineer\n  * Chief Technology Officer\n  * DevOps Engineer\n  * Blockchain Developer\n  * Human-Computer Interaction Designer\n  * Quantum Computing Researcher\n  * Systems Architect\n  * Bioinformatics Specialist\n  * High-Performance Computing Engineer\n\n\nWhich notable companies and organizations have employed UW computer science alumni? \n  * OpenAI\n  * Indiana University-Southeast\n  * Milwaukee School of Engineering\n  * UpLink Robotics\n  * Accenture\n  * Sunrun\n  * VMware\n  * LinkedIn\n\n\nWhich industries are hiring computer science graduate degree holders? \n  * Technology and Software Development\n  * Finance and Fintech\n  * Healthcare and Bioinformatics\n  * Cybersecurity and Defense\n  * Government and Public Sector\n  * Education and Research Institutions\n  * Automotive and Robotics\n  * Telecommunications\n  * E-commerce and Retail\n  * Entertainment and Game Development\n\n\nWill a graduate degree in computer science improve my job prospects? \nYes, a graduate degree in computer science can significantly improve your job prospects. It can open doors to advanced roles in areas like AI, data science, cybersecurity and research, and often leads to higher salaries, leadership positions and greater job flexibility across many industries.\n[Apply Now](https://www.uwyo.edu/admissions/apply.html)[Visit Campus](https://www.uwyo.edu/admissions/visit/index.html)[Request Info](https://uwyo-erx.my.salesforce-sites.com/leads/apex/ERx_Forms__PageMaker?pageId=Graduate&UW=Grad)\n### Related Programs\nInterested in a M.S. or Ph.D. in computer science? These programs may also be of interest to you:\n  * [B.S. in Computer Science](https://www.uwyo.edu/uw/degree-programs/computer-science-bachelors.html \"Learn more about the B.S. in Computer Science\")\n  * [M.S. in Artificial Intelligence](https://www.uwyo.edu/uw/degree-programs/artificial-intelligence-masters.html \"Learn more about the M.S. in Artificial Intelligence\")\n  * [M.S. in Electrical Engineering](https://www.uwyo.edu/uw/degree-programs/electrical-engineering-masters.html \"Learn more about the M.S. in Electrical Engineering\")\n  * [Ph.D. in Electrical Engineering](https://www.uwyo.edu/uw/degree-programs/electrical-engineering-phd.html \"Learn more about the Ph.D. in Electrical Engineering\")\n\n\nQuick Links\n[Tuition & Fees](https://www.uwyo.edu/sfa/cost-of-attendance/index.html \"View tuition and fees information\")[M.S. Courses & Curriculum Information](https://acalogcatalog.uwyo.edu/preview_program.php?catoid=16&poid=17362&_gl=1*1jlyun0*_ga*MTA4ODMwNDE2MS4xNzM2NzkzMDYx*_ga_DCJG3HESYS*czE3NDczNDE0MDAkbzIyMiRnMSR0MTc0NzM0MjE5MSRqNTMkbDAkaDA.*_gcl_au*NDY3NTI3MzIxLjE3NDcxNTk2ODk. \"View M.S. courses and curriculum information\")[Ph.D. Courses & Curriculum Information](https://acalogcatalog.uwyo.edu/preview_program.php?catoid=16&poid=17363&_gl=1*1jlyun0*_ga*MTA4ODMwNDE2MS4xNzM2NzkzMDYx*_ga_DCJG3HESYS*czE3NDczNDE0MDAkbzIyMiRnMSR0MTc0NzM0MjE5MSRqNTMkbDAkaDA.*_gcl_au*NDY3NTI3MzIxLjE3NDcxNTk2ODk. \"View Ph.D. courses and curriculum information\")\nDepartments\n[College of Engineering and Physical Sciences](https://www.uwyo.edu/ceps/index.html \"Learn more about the College of Engineering and Physical Sciences\")[Department of Electrical Engineering and Computer Science](https://www.uwyo.edu/eecs/about/index.html \"Learn more about the Department of Electrical Engineering and Computer Science\")\n## Contact Us\nCollege of Engineering and Physical Sciences\n  * Department of Electrical Engineering and Computer Science\n  * Department 3295, 1000 E. University Avenue\n  * Laramie, WY 82071\n  * Email: ece@uwyo.edu\n  * Phone: [(307) 766-2279](tel:307-766-2279)\n\n\nThe University of Wyoming has earned its Research Level 1 (R1) status from the Carnegie Classification of Institutions of Higher Education, placing Wyoming's only four-year university with the [top research universities](https://www.uwyo.edu/research/index.html \"Learn more about the research happening at the University of Wyoming\") in the United States.\n"
    }
}